catphish/simplescope-firmware/ch569.h
/********************************** (C) COPYRIGHT *******************************
* File Name          : CH56xSFR.h
* Author             : WCH, bvernoux
* Version            : V1.1.2
* Date               : 2022/08/13
* Description
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Copyright (c) 2022 Benjamin VERNOUX
* SPDX-License-Identifier: Apache-2.0
*******************************************************************************/
#ifndef __BASE_TYPE__
#define __BASE_TYPE__

#include <stdint.h>
#include <stdbool.h>

/* ********************************************************************************************************************* */
/* Base types & constants */

#ifndef NULL
#define NULL    0
#endif

#ifndef vuint8_t
typedef unsigned char volatile vuint8_t;
#endif
#ifndef vuint16_t
typedef unsigned short volatile vuint16_t;
#endif
#ifndef vuint32_t
typedef unsigned long volatile vuint32_t;
#endif
#ifndef vuint64_t
typedef unsigned long long volatile vuint64_t;
#endif

#ifndef pint8_t
typedef char *pint8_t;
#endif
#ifndef pint16_t
typedef short *pint16_t;
#endif
#ifndef pint32_t
typedef long *pint32_t;
#endif
#ifndef puint8_t
typedef unsigned char *puint8_t;
#endif
#ifndef puint16_t
typedef unsigned short *puint16_t;
#endif
#ifndef puint32_t
typedef unsigned long *puint32_t;
#endif
#ifndef vpuint8_t
typedef volatile unsigned char *vpuint8_t;
#endif
#ifndef vpuint16_t
typedef volatile unsigned short *vpuint16_t;
#endif
#ifndef vpuint32_t
typedef volatile unsigned long *vpuint32_t;
#endif

/* ********************************************************************************************************************* */
/* Base macros */

#ifndef min
#define min(a, b)    (((a) < (b)) ? (a) : (b))
#endif
#ifndef max
#define max(a, b)    (((a) > (b)) ? (a) : (b))
#endif

#ifdef DEBUG
#define PRINT(X...)    printf(X)
#else
#define PRINT(X...)
#endif

/* Calculate the byte offset of a field in a structure of type */
#define FIELD_OFFSET(Type, Field) ((uint16_t) & (((Type *)0)->Field))

/* Calculate the size of a field in a structure of type */
#define FIELD_SIZE(Type, Field) (sizeof(((Type *)0)->Field))

/* An expression that yields the type of a field in a struct */
#define FIELD_TYPE(Type, Field) (((Type *)0)->Field)

/* Return the number of elements in a statically sized array */
#define NUMBER_OF(Array) (sizeof(Array) / sizeof((Array)[0]))
#define NUMBER_OF_FIELD(Type, Field) (NUMBER_OF(FIELD_TYPE(Type, Field)))

#endif // __BASE_TYPE__

#ifndef __CH56xGPSFR_H__
#define __CH56xGPSFR_H__

/* ********************************************************************************************************************* */
// Address Space
//    CODE:   00000000H - 0007FFFFH   512KB
//    DATA:   20000000H - 20003FFFH   16KB
//    DATAX:  20020000H - 20037FFFH   96KB (Min:32KB, Max:96KB)
//    SFR:    40000000H - 4000FFFFH   64KB
//    BUS:    80000000H - 80007FFFH   32KB
//
//    SFR:    40000000H - 4000FFFFH, 64KB
//      SYS:     +1000H - 13FFH, include base configuration, interrupt, GPIO, etc...
//      TMR0:    +2000H - 23FFH
//      TMR1:    +2400H - 27FFH
//      TMR2:    +2800H - 2BFFH
//      UART0:   +3000H - 33FFH
//      UART1:   +3400H - 37FFH
//      UART2:   +3800H - 3BFFH
//      UART3:   +3C00H - 3FFFH
//      SPI0:    +4000H - 43FFH
//      SPI1:    +4400H - 47FFH
//      PWMX:    +5000H - 53FFH
//      HSPI:     +6000H - 63FFH
//      ECDC:     +7000H - 73FFH
//      USBSS:   +8000H - 83FFH
//      USBHS:   +9000H - 93FFH
//      EMMC:    +A000H - A3FFH
//      SERDES:  +B000H - B3FFH
//      ETH:     +C000H - D3FFH
//      DVP:     +E000H - E3FFH

// Register Bit Attribute / Bit Access Type
//   RF:    Read only for Fixed value
//   RO:    Read Only (internal change)
//   RZ:    Read only with auto clear Zero
//   WO:    Write Only (read zero or different)
//   WA:    Write only under safe Accessing mode (read zero or different)
//   WZ:    Write only with auto clear Zero
//   RW:    Read / Write
//   RWA:   Read / Write under safe Accessing mode
//   RW1:   Read / Write 1 to Clear

/* Register name rule:
   R32_* for 32 bits register (uint32_t,ULONG)
   R16_* for 16 bits register (uint16_t,USHORT)
   R8_*  for  8 bits register (uint8_t,UCHAR)
   RB_*  for bit or bit mask of 8 bit register
   BA_*  for base address point
   b*    for GPIO bit mask
   Others for register address offset */

/* ********************************************************************************************************************* */

/* System: safe accessing register */
#define R32_SAFE_ACCESS    (*((vpuint32_t)0x40001000)) // RW, safe accessing
#define R8_SAFE_ACCESS_SIG (*((vpuint8_t)0x40001000))  // WO, safe accessing sign register, must write 0x57 then 0xA8 to enter safe accessing mode
#define RB_SAFE_ACC_MODE   0x03                      // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define RB_SAFE_ACC_TIMER  0x70                      // RO, safe accessing timer bit mask (16*clock number)
#define R8_CHIP_ID         (*((vpuint8_t)0x40001001))  // RF, chip ID register, always is ID_CH569W
#define R8_SAFE_ACCESS_ID  (*((vpuint8_t)0x40001002))  // RF, safe accessing ID register, always 0x02
#define R8_WDOG_COUNT      (*((vpuint8_t)0x40001003))  // RW, watch-dog count, count by clock frequency Fsys/524288

/* System: global configuration register */
#define R32_GLOBAL_CONFIG (*((vpuint32_t)0x40001004)) // RW, global configuration
#define R8_GLOB_ROM_CFG   (*((vpuint8_t)0x40001004))  // RWA, flash ROM configuration, SAM and bit7:6 must write 1:0
#define RB_ROM_EXT_RE     0x01                      // RWA, enable flash ROM being read by external programmer: 0=reading protect, 1=enable read
#define RB_CODE_RAM_WE    0x02                      // RWA, enable code RAM being write: 0=writing protect, 1=enable write
#define RB_ROM_DATA_WE    0x04                      // RWA, enable flash ROM data area being erase/write: 0=writing protect, 1=enable program and erase
#define RB_ROM_CODE_WE    0x08                      // RWA, enable flash ROM code & data area being erase/write: 0=writing protect, 1=enable program and erase
#define RB_ROM_CODE_OFS   0x10                      // RWA,
//#define  RB_GLOB_BOOT_APP 0x10 // RO, boot loader action status
#define R8_RST_BOOT_STAT (*((vpuint8_t)0x40001005)) // RO, reset status and boot/debug status, bit7:6 always are 1:1
#define RB_RESET_FLAG    0x03                     // RO: recent reset flag
#define RST_FLAG_SW      0x00
#define RST_FLAG_POR     0x01
#define RST_FLAG_WDOG    0x02
#define RST_FLAG_PIN     0x03
// RB_RESET_FLAG: recent reset flag
//    00 - software reset, by RB_SOFTWARE_RESET=1 @(RB_BOOT_LOADER=0 or RB_WDOG_RST_EN=1), or set reset request from PFIC
//    01 - power on reset
//    10 - watch-dog timer overflow reset, or CORE LOCKUP reset
//    11 - external manual reset by RST# pin input low
#define RB_CFG_RESET_EN    0x04                     // RO, manual reset input enable status
#define RB_CFG_BOOT_EN     0x08                     // RO, boot-loader enable status
#define RB_CFG_DEBUG_EN    0x10                     // RO, debug enable status
#define RB_BOOT_LOADER     0x20                     // RO, indicate boot loader status: 0=application status (by software reset), 1=boot loader status
#define R8_RST_WDOG_CTRL   (*((vpuint8_t)0x40001006)) // RWA, reset and watch-dog control, SAM and bit7:6 must write 0:1
#define RB_SOFTWARE_RESET  0x01                     // WA/WZ, global software reset, high action, auto clear
#define RB_WDOG_RST_EN     0x02                     // RWA, enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow
#define RB_WDOG_INT_EN     0x04                     // RWA, watch-dog interrupt enable or INT_ID_WDOG interrupt source selection: 0=software interrupt, 1=from watch-dog timer overflow
#define RB_WDOG_INT_FLAG   0x10                     // RW1, watch-dog timer overflow interrupt flag, cleared by RW1 or reload watch-dog count
#define R8_GLOB_RESET_KEEP (*((vpuint8_t)0x40001007)) // RW, value keeper during global reset

/* System: clock configuration register */
#define R32_CLOCK_CONFIG (*((vpuint32_t)0x40001008)) // RWA, clock configuration, SAM
#define R8_CLK_PLL_DIV   (*((vpuint8_t)0x40001008))  // RWA, output clock divider from PLL, only low 4 bit, SAM and bit7:6 must write 0:1
#define R8_CLK_CFG_CTRL  (*((vpuint8_t)0x4000100A))  // RWA, clock control, SAM and bit7:6 must write 1:0
#define RB_CLK_PLL_SLEEP 0x01                      // RWA, PLL sleep control: 0=PLL run, 1=PLL sleep
#define RB_CLK_SEL_PLL   0x02                      // RWA, clock source selection: 0=oscillator 30MHz, 1=PLL 300MHz/480MHz
// OSC_FREQ = 30MHz
// PLL_FREQ = 300MHz/480MHz
// SRC_FREQ = RB_CLK_SEL_PLL ? PLL_FREQ : OSC_FREQ
// SYS_FREQ = SRC_FREQ / R8_CLK_PLL_DIV, 2MHz ~ 120MHz
// default: SRC_FREQ = 30MHz/2 = 15MHz
#define R8_CLK_MOD_AUX  (*((vpuint8_t)0x4000100B)) // RWA, clock mode aux register
#define RB_SRC_125M_MSK 0x03                     // RWA, ETH 125MHz clock enable, high enable,[1]: clock from pin_pa[16], [0]: clock from USB_PHY PCLK(125MHz)
#define RB_EXT_125M_EN  0x02
#define RB_INT_125M_EN  0x01
#define RB_MCO_SEL_MSK  0x0C        // RWA, MCO output selection: 00=125M, 01=25M, 1x=2.5M
#define RB_SEL_125M     0x00
#define RB_SEL_25M      0x04
#define RB_SEL_2P5M     0x08
#define RB_MCO_EN       0x10        // RWA, MCO output enable, high action

