catphish/simplescope-firmware/ch569.h
/* System: sleep control register */
#define R32_SLEEP_CONTROL  (*((vpuint32_t)0x4000100C)) // RWA, sleep control, SAM
#define R8_SLP_CLK_OFF0    (*((vpuint8_t)0x4000100C))  // RWA, sleep clock off control byte 0, SAM
#define RB_SLP_CLK_TMR0    0x01                      // RWA, sleep TMR0 clock
#define RB_SLP_CLK_TMR1    0x02                      // RWA, sleep TMR1 clock
#define RB_SLP_CLK_TMR2    0x04                      // RWA, sleep TMR2 clock
#define RB_SLP_CLK_PWMX    0x08                      // RWA, sleep PWMX clock
#define RB_SLP_CLK_UART0   0x10                      // RWA, sleep UART0 clock
#define RB_SLP_CLK_UART1   0x20                      // RWA, sleep UART1 clock
#define RB_SLP_CLK_UART2   0x40                      // RWA, sleep UART2 clock
#define RB_SLP_CLK_UART3   0x80                      // RWA, sleep UART3 clock
#define R8_SLP_CLK_OFF1    (*((vpuint8_t)0x4000100D))  // RWA, sleep clock off control byte 1, SAM
#define RB_SLP_CLK_SPI0    0x01                      // RWA, sleep SPI0 clock
#define RB_SLP_CLK_SPI1    0x02                      // RWA, sleep SPI1 clock
#define RB_SLP_CLK_EMMC    0x04                      // RWA, sleep EMMC clock
#define RB_SLP_CLK_HSPI    0x08                      // RWA, sleep HSPI clock
#define RB_SLP_CLK_USBHS   0x10                      // RWA, sleep USBHS clock
#define RB_SLP_CLK_USBSS   0x20                      // RWA, sleep USBSS clock
#define RB_SLP_CLK_SERD    0x40                      // RWA, sleep SERDES clock
#define RB_SLP_CLK_DVP     0x80                      // RWA, sleep DVP clock
#define R8_SLP_WAKE_CTRL   (*((vpuint8_t)0x4000100E))  // RWA, wake control, SAM
#define RB_SLP_USBHS_WAKE  0x01                      // RWA, enable USBHS waking
#define RB_SLP_USBSS_WAKE  0x02                      // RWA, enable USBSS waking
#define RB_SLP_CLK_ETH     0x04                      // RWA, sleep ETH clock
#define RB_SLP_CLK_ECDC    0x08                      // RWA, sleep ECDC CLOCK
#define RB_SLP_GPIO_WAKE   0x10                      // RWA, enable GPIO waking
#define RB_SLP_ETH_WAKE    0x20                      // RWA, enable Eth waking
#define R8_SLP_POWER_CTRL  (*((vpuint8_t)0x4000100F))  // RWA, power control, SAM
#define RB_SLP_USBHS_PWRDN 0x01                      // RWA, enable USBHS power down

/* System: port and bus configuration register */
#define R32_PORT_CONFIG  (*((vpuint32_t)0x40001010)) // RW, port and bus configuration
#define R8_XBUS_CONFIG   (*((vpuint8_t)0x40001010))  // RW, external bus configuration
#define RB_XBUS_ENABLE   0x01                      // RW, external bus enable: 0=disable, 1=enable bRD and bWR, enable PA[7:0] as parallel DATA port
#define RB_XBUS_ADDR_OE  0x0C                      // RW, external bus address output enable: 00=none, 01=PB[5:0], 10=PB[9:0], 11=PB[14:0]
#define RB_XBUS_WIDTH    0x30                      // RW, external bus access pulse width: 00=3 clocks, 01=5 clocks, 10= 9 clocks, 11=16 clocks
#define RB_XBUS_HOLD     0x40                      // RW, external bus hold time: 0=2 clocks, 1=3 clocks
#define RB_XBUS_SETUP    0x80                      // RW, external bus setup time: 0=2 clocks, 1=3 clocks
#define R8_PIN_ALTERNATE (*((vpuint8_t)0x40001012))  // RW, alternate pin control
#define RB_PIN_MII       0x01                      // RW, ETH mii interface selection: 0=MII interface, 1=RGMII interface
#define RB_PIN_TMR1      0x02                      // RW, TMR1 alternate pin enable: 0=TMR1/PWM5/CAP1 on PA[4], 1=TMR1X/PWM5X/CAP1X on PB[0]
#define RB_PIN_TMR2      0x04                      // RW, TMR2 alternate pin enable: 0=TMR2/PWM6/CAP2 on PA[6], 1=TMR2X/PWM6X/CAP2X on PB[3]
#define RB_PIN_UART0     0x10                      // RW, RXD0/TXD0 alternate pin enable: 0=RXD1/TXD1 on PB[5]/PB[6], 1=RXD1X/TXD1X on PA[5]/PA[6]

/* System: Serdes Analog parameter control register */
#define R16_SERD_ANA_CFG1 (*((vpuint16_t)0x40001020)) //RWA, Serdes Analog parameter configuration1
#define R32_SERD_ANA_CFG2 (*((vpuint32_t)0x40001024)) //RWA, Serdes Analog parameter configuration2

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_CTRL  (*((vpuint32_t)0x4000101C)) // RW, GPIO interrupt control
#define R8_GPIO_INT_FLAG   (*((vpuint8_t)0x4000101C))  // RW1, GPIO interrupt flag
#define R8_GPIO_INT_ENABLE (*((vpuint8_t)0x4000101D))  // RW, GPIO interrupt enable
#define R8_GPIO_INT_MODE   (*((vpuint8_t)0x4000101E))  // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R8_GPIO_INT_POLAR  (*((vpuint8_t)0x4000101F))  // RW, GPIO interrupt polarity: 0=normal(low_level/fall_edge), 1=invert(high_level/rise_edge)

/* GPIO interrupt control register address offset and bit define */
#define BA_GPIO_INT_CTRL ((vpuint8_t)0x4000101C) // point GPIO interrupt base address
#define GPIO_INT_FLAG    0x00
#define GPIO_INT_ENABLE  0x01
#define GPIO_INT_MODE    0x02
#define GPIO_INT_POLAR   0x03
#define RB_GPIO_PA2      0x01
#define RB_GPIO_PA3      0x02
#define RB_GPIO_PA4      0x04
#define RB_GPIO_PB3      0x08
#define RB_GPIO_PB4      0x10
#define RB_GPIO_PB11     0x20
#define RB_GPIO_PB12     0x40
#define RB_GPIO_PB15     0x80

/* GPIO PA register */
#define R32_PA_DIR  (*((vpuint32_t)0x40001040)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0 (*((vpuint8_t)0x40001040))  // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1 (*((vpuint8_t)0x40001041))  // RW, GPIO PA I/O direction byte 1
#define R8_PA_DIR_2 (*((vpuint8_t)0x40001042))  // RW, GPIO PA I/O direction byte 2
#define R32_PA_PIN  (*((vpuint32_t)0x40001044)) // RO, GPIO PA input
#define R8_PA_PIN_0 (*((vpuint8_t)0x40001044))  // RO, GPIO PA input byte 0
#define R8_PA_PIN_1 (*((vpuint8_t)0x40001045))  // RO, GPIO PA input byte 1
#define R8_PA_PIN_2 (*((vpuint8_t)0x40001046))  // RO, GPIO PA input byte 2
#define R32_PA_OUT  (*((vpuint32_t)0x40001048)) // RW, GPIO PA output
#define R8_PA_OUT_0 (*((vpuint8_t)0x40001048))  // RW, GPIO PA output byte 0
#define R8_PA_OUT_1 (*((vpuint8_t)0x40001049))  // RW, GPIO PA output byte 1
#define R8_PA_OUT_2 (*((vpuint8_t)0x4000104A))  // RW, GPIO PA output byte 2
#define R32_PA_CLR  (*((vpuint32_t)0x4000104C)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0 (*((vpuint8_t)0x4000104C))  // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1 (*((vpuint8_t)0x4000104D))  // WZ, GPIO PA clear output byte 1
#define R8_PA_CLR_2 (*((vpuint8_t)0x4000104E))  // WZ, GPIO PA clear output byte 2
#define R32_PA_PU   (*((vpuint32_t)0x40001050)) // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0  (*((vpuint8_t)0x40001050))  // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1  (*((vpuint8_t)0x40001051))  // RW, GPIO PA pullup resistance enable byte 1
#define R8_PA_PU_2  (*((vpuint8_t)0x40001052))  // RW, GPIO PA pullup resistance enable byte 2
#define R32_PA_PD   (*((vpuint32_t)0x40001054)) // RW, GPIO PA output open-drain & input pulldown resistance enable
#define R8_PA_PD_0  (*((vpuint8_t)0x40001054))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 0
#define R8_PA_PD_1  (*((vpuint8_t)0x40001055))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 1
#define R8_PA_PD_2  (*((vpuint8_t)0x40001056))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 2
#define R32_PA_DRV  (*((vpuint32_t)0x40001058)) // RW, GPIO PA driving capability: 0=8mA, 1=16mA
#define R8_PA_DRV_0 (*((vpuint8_t)0x40001058))  // RW, GPIO PA driving capability byte 0
#define R8_PA_DRV_1 (*((vpuint8_t)0x40001059))  // RW, GPIO PA driving capability byte 1
#define R8_PA_DRV_2 (*((vpuint8_t)0x4000105A))  // RW, GPIO PA driving capability byte 2
#define R32_PA_SMT  (*((vpuint32_t)0x4000105C)) // RW, GPIO PA output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PA_SMT_0 (*((vpuint8_t)0x4000105C))  // RW, GPIO PA output slew rate & input schmitt trigger byte 0
#define R8_PA_SMT_1 (*((vpuint8_t)0x4000105D))  // RW, GPIO PA output slew rate & input schmitt trigger byte 1
#define R8_PA_SMT_2 (*((vpuint8_t)0x4000105E))  // RW, GPIO PA output slew rate & input schmitt trigger byte 2

/* GPIO PB register */
#define R32_PB_DIR  (*((vpuint32_t)0x40001060)) // RW, GPIO PB I/O direction: 0=in, 1=out
#define R8_PB_DIR_0 (*((vpuint8_t)0x40001060))  // RW, GPIO PB I/O direction byte 0
#define R8_PB_DIR_1 (*((vpuint8_t)0x40001061))  // RW, GPIO PB I/O direction byte 1
#define R8_PB_DIR_2 (*((vpuint8_t)0x40001062))  // RW, GPIO PB I/O direction byte 2
#define R8_PB_DIR_3 (*((vpuint8_t)0x40001063))  // RW, GPIO PB I/O direction byte 3
#define R32_PB_PIN  (*((vpuint32_t)0x40001064)) // RO, GPIO PB input
#define R8_PB_PIN_0 (*((vpuint8_t)0x40001064))  // RO, GPIO PB input byte 0
#define R8_PB_PIN_1 (*((vpuint8_t)0x40001065))  // RO, GPIO PB input byte 1
#define R8_PB_PIN_2 (*((vpuint8_t)0x40001066))  // RO, GPIO PB input byte 2
#define R8_PB_PIN_3 (*((vpuint8_t)0x40001067))  // RO, GPIO PB input byte 3
#define R32_PB_OUT  (*((vpuint32_t)0x40001068)) // RW, GPIO PB output
#define R8_PB_OUT_0 (*((vpuint8_t)0x40001068))  // RW, GPIO PB output byte 0
#define R8_PB_OUT_1 (*((vpuint8_t)0x40001069))  // RW, GPIO PB output byte 1
#define R8_PB_OUT_2 (*((vpuint8_t)0x4000106A))  // RW, GPIO PB output byte 2
#define R8_PB_OUT_3 (*((vpuint8_t)0x4000106B))  // RW, GPIO PB output byte 3
#define R32_PB_CLR  (*((vpuint32_t)0x4000106C)) // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R8_PB_CLR_0 (*((vpuint8_t)0x4000106C))  // WZ, GPIO PB clear output byte 0
#define R8_PB_CLR_1 (*((vpuint8_t)0x4000106D))  // WZ, GPIO PB clear output byte 1
#define R8_PB_CLR_2 (*((vpuint8_t)0x4000106E))  // WZ, GPIO PB clear output byte 2
#define R8_PB_CLR_3 (*((vpuint8_t)0x4000106F))  // WZ, GPIO PB clear output byte 3
#define R32_PB_PU   (*((vpuint32_t)0x40001070)) // RW, GPIO PB pullup resistance enable
#define R8_PB_PU_0  (*((vpuint8_t)0x40001070))  // RW, GPIO PB pullup resistance enable byte 0
#define R8_PB_PU_1  (*((vpuint8_t)0x40001071))  // RW, GPIO PB pullup resistance enable byte 1
#define R8_PB_PU_2  (*((vpuint8_t)0x40001072))  // RW, GPIO PB pullup resistance enable byte 2
#define R8_PB_PU_3  (*((vpuint8_t)0x40001073))  // RW, GPIO PB pullup resistance enable byte 3
#define R32_PB_PD   (*((vpuint32_t)0x40001074)) // RW, GPIO PB output open-drain & input pulldown resistance enable
#define R8_PB_PD_0  (*((vpuint8_t)0x40001074))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 0
#define R8_PB_PD_1  (*((vpuint8_t)0x40001075))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 1
#define R8_PB_PD_2  (*((vpuint8_t)0x40001076))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 2
#define R8_PB_PD_3  (*((vpuint8_t)0x40001077))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 3
#define R32_PB_DRV  (*((vpuint32_t)0x40001078)) // RW, GPIO PB driving capability: 0=8mA, 1=16mA
#define R8_PB_DRV_0 (*((vpuint8_t)0x40001078))  // RW, GPIO PB driving capability byte 0
#define R8_PB_DRV_1 (*((vpuint8_t)0x40001079))  // RW, GPIO PB driving capability byte 1
#define R8_PB_DRV_2 (*((vpuint8_t)0x4000107A))  // RW, GPIO PB driving capability byte 2
#define R8_PB_DRV_3 (*((vpuint8_t)0x4000107B))  // RW, GPIO PB driving capability byte 3
#define R32_PB_SMT  (*((vpuint32_t)0x4000107C)) // RW, GPIO PB output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PB_SMT_0 (*((vpuint8_t)0x4000107C))  // RW, GPIO PB output slew rate & input schmitt trigger byte 0
#define R8_PB_SMT_1 (*((vpuint8_t)0x4000107D))  // RW, GPIO PB output slew rate & input schmitt trigger byte 1
#define R8_PB_SMT_2 (*((vpuint8_t)0x4000107E))  // RW, GPIO PB output slew rate & input schmitt trigger byte 2
#define R8_PB_SMT_3 (*((vpuint8_t)0x4000107F))  // RW, GPIO PB output slew rate & input schmitt trigger byte 3

/* GPIO register address offset and bit define */
#define BA_PA      ((vpuint8_t)0x40001040) // point GPIO PA base address
#define BA_PB      ((vpuint8_t)0x40001060) // point GPIO PB base address
#define GPIO_DIR   0x00
#define GPIO_DIR_0 0x00
#define GPIO_DIR_1 0x01
#define GPIO_DIR_2 0x02
#define GPIO_DIR_3 0x03
#define GPIO_PIN   0x04
#define GPIO_PIN_0 0x04
#define GPIO_PIN_1 0x05
#define GPIO_PIN_2 0x06
#define GPIO_PIN_3 0x07
#define GPIO_OUT   0x08
#define GPIO_OUT_0 0x08
#define GPIO_OUT_1 0x09
#define GPIO_OUT_2 0x0A
#define GPIO_OUT_3 0x0B
#define GPIO_CLR   0x0C
#define GPIO_CLR_0 0x0C
#define GPIO_CLR_1 0x0D
#define GPIO_CLR_2 0x0E
#define GPIO_CLR_3 0x0F
#define GPIO_PU    0x10
#define GPIO_PU_0  0x10
#define GPIO_PU_1  0x11
#define GPIO_PU_2  0x12
#define GPIO_PU_3  0x13
#define GPIO_PD    0x14
#define GPIO_PD_0  0x14
#define GPIO_PD_1  0x15
#define GPIO_PD_2  0x16
#define GPIO_PD_3  0x17
#define GPIO_DRV   0x18
#define GPIO_DRV_0 0x18
#define GPIO_DRV_1 0x19
#define GPIO_DRV_2 0x1A
#define GPIO_DRV_3 0x1B
#define GPIO_SMT   0x1C
#define GPIO_SMT_0 0x1C
#define GPIO_SMT_1 0x1D
#define GPIO_SMT_2 0x1E
#define GPIO_SMT_3 0x1F

/* GPIO alias name */
/* GPIOA */
#define bHSPI6   (1 << 0) // PA0
#define bSDD5    (1 << 0) // PA0
#define bDVP3    (1 << 0) // PA0
#define bHSPI5   (1 << 1) // PA1
#define bSDD6    (1 << 1) // PA1
#define bDVP2    (1 << 1) // PA1
#define bHSPI4   (1 << 2) // PA2
#define bRXD2    (1 << 2) // PA2
#define bSDD7    (1 << 2) // PA2
#define bDVP1    (1 << 2) // PA2
#define bHSPI3   (1 << 3) // PA3
#define bTXD2    (1 << 3) // PA3
#define bDVP0    (1 << 3) // PA3
#define bHSPI1   (1 << 4) // PA4
#define bPWM1    (1 << 4) // PA4
#define bTMR2    (1 << 4) // PA4
#define bCAP2    bTMR2
#define bPWM6    bTMR2
#define bVSYNC   (1 << 4) // PA4
#define bHSPI0   (1 << 5) // PA5
#define bRXD0X   (1 << 5) // PA5
#define bHSYNC   (1 << 5) // PA5
#define bHSPIRV  (1 << 6) // PA6
#define bTXD0X   (1 << 6) // PA6
#define bPCLK    (1 << 6) // PA6
#define bRXD1    (1 << 7) // PA7
#define bTXD1    (1 << 8) // PA8
#define bBUSRD   (1 << 8) // PA8
#define bHSPITRQ (1 << 9) // PA9
#define bTMR0    (1 << 9) // PA9
#define bCAP0    bTMR0
#define bPWM4    bTMR0
#define bBUSWR   (1 << 9)  // PA9
#define bHSPITAK (1 << 10) // PA10
#define bDBGCK   (1 << 10) // PA10
#define bHSPITCK (1 << 11) // PA11
#define bDBGIO   (1 << 11) // PA11
#define bSCS0    (1 << 12) // PA12
#define bSCK0    (1 << 13) // PA13
#define bMOSI0   (1 << 14) // PA14
#define bMISO0   (1 << 15) // PA15
#define bHSPI24  (1 << 16) // PA16
#define bEMCI    (1 << 16) // PA16
#define bHSPI12  (1 << 17) // PA17
#define bHSPIRAT (1 << 18) // PA18
#define bHSPIRCK (1 << 19) // PA19
#define bHSPI19  (1 << 20) // PA20
#define bEMCO    (1 << 20) // PA20
#define bHSPITV  (1 << 21) // PA21
#define bHSPI2   (1 << 22) // PA22
#define bHSPITRY (1 << 23) // PA23

/* GPIOB */
#define bHSPI16 (1 << 0) // PB0
#define bTMR1X  (1 << 0) // PB0
#define bCAP1X  bTMR1X
#define bPWM5X  bTMR1X
#define bMDIO   (1 << 0) // PB0
#define bHSPI17 (1 << 1) // PB1
#define bPWM2   (1 << 1) // PB1
#define bMDCK   (1 << 1) // PB1
#define bHSPI18 (1 << 2) // PB2
#define bPWM3   (1 << 2) // PB2
#define bETHT3  (1 << 2) // PB2
#define bHSPI20 (1 << 3) // PB3
#define bTMR2X  (1 << 3) // PB3
#define bCAP2X  bTMR2X
#define bPWM6X  bTMR2X
#define bRXD3   (1 << 3)  // PB3
#define bETHT2  (1 << 3)  // PB3
#define bHSPI21 (1 << 4)  // PB4
#define bTXD3   (1 << 4)  // PB4
#define bETHT1  (1 << 4)  // PB4
#define bHSPI22 (1 << 5)  // PB5
#define bRXD0   (1 << 5)  // PB5
#define bETHT0  (1 << 5)  // PB5
#define bHSPI23 (1 << 6)  // PB6
#define bTXD0   (1 << 6)  // PB6
#define bETHTEN (1 << 6)  // PB6
#define bHSPI25 (1 << 7)  // PB7
#define bDSR    (1 << 7)  // PB7
#define bETHTC  (1 << 7)  // PB7
#define bHSPI26 (1 << 8)  // PB8
#define bRI     (1 << 8)  // PB8
#define bETHRC  (1 << 8)  // PB8
#define bHSPI27 (1 << 9)  // PB9
#define bDCD    (1 << 9)  // PB9
#define bETHR3  (1 << 9)  // PB9
#define bHSPI28 (1 << 10) // PB10
#define bDTR    (1 << 10) // PB10
#define bETHR2  (1 << 10) // PB10
#define bHSPI29 (1 << 11) // PB11
#define bSCS1   (1 << 11) // PB11
#define bCTS    (1 << 11) // PB11
#define bETHR1  (1 << 11) // PB11
#define bHSPI30 (1 << 12) // PB12
#define bSCK1   (1 << 12) // PB12
#define bRTS    (1 << 12) // PB12
#define bETHR0  (1 << 12) // PB12
#define bHSPI31 (1 << 13) // PB13
#define bMOSI1  (1 << 13) // PB13
#define bETHRDV (1 << 13) // PB13
#define bHSPI15 (1 << 14) // PB14
#define bMISO1  (1 << 14) // PB14
#define bSDCK   (1 << 14) // PB14
#define bDVP11  (1 << 14) // PB14
#define bHSPI14 (1 << 15) // PB15
#define bTMR1   (1 << 15) // PB15
#define bCAP1   bTMR1
#define bPWM5   bTMR1
#define bPWM0   (1 << 15) // PB15
#define bDVP10  (1 << 15) // PB15
#define bHSPI13 (1 << 16) // PB16
#define bSDCMD  (1 << 16) // PB16
#define bDVP9   (1 << 16) // PB16
#define bHSPI11 (1 << 17) // PB17
#define bSDD0   (1 << 17) // PB17
#define bDVP8   (1 << 17) // PB17
#define bHSPI10 (1 << 18) // PB18
#define bSDD1   (1 << 18) // PB18
#define bDVP7   (1 << 18) // PB18
#define bHSPI9  (1 << 19) // PB19
#define bSDD2   (1 << 19) // PB19
#define bDVP6   (1 << 19) // PB19
#define bHSPI8  (1 << 20) // PB20
#define bSDD3   (1 << 20) // PB20
#define bDVP5   (1 << 20) // PB20
#define bHSPI7  (1 << 21) // PB21
#define bSDD4   (1 << 21) // PB21
#define bDVP4   (1 << 21) // PB21

/* Timer0 register */
#define R32_TMR0_CONTROL     (*((vpuint32_t)0x40002000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD     (*((vpuint8_t)0x40002000))  // RW, TMR0 mode control
#define R8_TMR0_INTER_EN     (*((vpuint8_t)0x40002002))  // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS      (*((vpuint32_t)0x40002004)) // RW, TMR0 status
#define R8_TMR0_INT_FLAG     (*((vpuint8_t)0x40002006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT   (*((vpuint8_t)0x40002007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT       (*((vpuint32_t)0x40002008)) // RO, TMR0 current count
#define R16_TMR0_COUNT       (*((vpuint16_t)0x40002008)) // RO, TMR0 current count
#define R8_TMR0_COUNT        (*((vpuint8_t)0x40002008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END     (*((vpuint32_t)0x4000200C)) // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO        (*((vpuint32_t)0x40002010)) // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO        (*((vpuint16_t)0x40002010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO         (*((vpuint8_t)0x40002010))  // RO/WO, TMR0 FIFO register

