catphish/simplescope-firmware/ch569.h
/* UART3 register */
#define R32_UART3_CTRL  (*((vpuint32_t)0x40003C00)) // RW, UART3 control
#define R8_UART3_MCR    (*((vpuint8_t)0x40003C00))  // RW, UART3 modem control
#define R8_UART3_IER    (*((vpuint8_t)0x40003C01))  // RW, UART3 interrupt enable
#define R8_UART3_FCR    (*((vpuint8_t)0x40003C02))  // RW, UART3 FIFO control
#define R8_UART3_LCR    (*((vpuint8_t)0x40003C03))  // RW, UART3 line control
#define R32_UART3_STAT  (*((vpuint32_t)0x40003C04)) // RO, UART3 status
#define R8_UART3_IIR    (*((vpuint8_t)0x40003C04))  // RO, UART3 interrupt identification
#define R8_UART3_LSR    (*((vpuint8_t)0x40003C05))  // RO, UART3 line status
#define R32_UART3_FIFO  (*((vpuint32_t)0x40003C08)) // RW, UART3 data or FIFO port
#define R8_UART3_RBR    (*((vpuint8_t)0x40003C08))  // RO, UART3 receiver buffer, receiving byte
#define R8_UART3_THR    (*((vpuint8_t)0x40003C08))  // WO, UART3 transmitter holding, transmittal byte
#define R8_UART3_RFC    (*((vpuint8_t)0x40003C0A))  // RO, UART3 receiver FIFO count
#define R8_UART3_TFC    (*((vpuint8_t)0x40003C0B))  // RO, UART3 transmitter FIFO count
#define R32_UART3_SETUP (*((vpuint32_t)0x40003C0C)) // RW, UART3 setup
#define R16_UART3_DL    (*((vpuint16_t)0x40003C0C)) // RW, UART3 divisor latch
#define R8_UART3_DLL    (*((vpuint8_t)0x40003C0C))  // RW, UART3 divisor latch LSB byte
#define R8_UART3_DLM    (*((vpuint8_t)0x40003C0D))  // RW, UART3 divisor latch MSB byte
#define R8_UART3_DIV    (*((vpuint8_t)0x40003C0E))  // RW, UART3 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

/* UART register address offset and bit define */
#define UART_FIFO_SIZE     8 // UART FIFO size (depth)
#define UART_RECV_RDY_SZ   7 // the max FIFO trigger level for UART receiver data available
#define BA_UART0           ((vpuint8_t)0x40003000) // point UART0 base address
#define BA_UART1           ((vpuint8_t)0x40003400) // point UART1 base address
#define BA_UART2           ((vpuint8_t)0x40003800) // point UART2 base address
#define BA_UART3           ((vpuint8_t)0x40003C00) // point UART3 base address
#define UART_MCR           0
#define RB_MCR_DTR         0x01 // RW, UART0 control DTR
#define RB_MCR_RTS         0x02 // RW, UART0 control RTS
#define RB_MCR_OUT1        0x04 // RW, UART0 control OUT1
#define RB_MCR_OUT2        0x08 // RW, UART control OUT2
#define RB_MCR_INT_OE      0x08 // RW, UART interrupt output enable
#define RB_MCR_LOOP        0x10 // RW, UART0 enable local loop back
#define RB_MCR_AU_FLOW_EN  0x20 // RW, UART0 enable autoflow control
#define RB_MCR_TNOW        0x40 // RW, UART0 enable TNOW output on DTR pin
#define RB_MCR_HALF        0x80 // RW, UART0 enable half-duplex
#define UART_IER           1
#define RB_IER_RECV_RDY    0x01 // RW, UART interrupt enable for receiver data ready
#define RB_IER_THR_EMPTY   0x02 // RW, UART interrupt enable for THR empty
#define RB_IER_LINE_STAT   0x04 // RW, UART interrupt enable for receiver line status
#define RB_IER_MODEM_CHG   0x08 // RW, UART0 interrupt enable for modem status change
#define RB_IER_DTR_EN      0x10 // RW, UART0 DTR/TNOW output pin enable
#define RB_IER_RTS_EN      0x20 // RW, UART0 RTS output pin enable
#define RB_IER_TXD_EN      0x40 // RW, UART TXD pin enable
#define RB_IER_RESET       0x80 // WZ, UART software reset control, high action, auto clear
#define UART_FCR           2
#define RB_FCR_FIFO_EN     0x01 // RW, UART FIFO enable
#define RB_FCR_RX_FIFO_CLR 0x02 // WZ, clear UART receiver FIFO, high action, auto clear
#define RB_FCR_TX_FIFO_CLR 0x04 // WZ, clear UART transmitter FIFO, high action, auto clear
#define RB_FCR_FIFO_TRIG   0xC0 // RW, UART receiver FIFO trigger level: 00-1byte, 01-2bytes, 10-4bytes, 11-7bytes
#define UART_LCR           3
#define RB_LCR_WORD_SZ     0x03 // RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit
#define RB_LCR_STOP_BIT    0x04 // RW, UART stop bit length: 0-1bit, 1-2bit
#define RB_LCR_PAR_EN      0x08 // RW, UART parity enable
#define RB_LCR_PAR_MOD     0x30 // RW, UART parity mode: 00-odd, 01-even, 10-mark, 11-space
#define RB_LCR_BREAK_EN    0x40 // RW, UART break control enable
#define RB_LCR_DLAB        0x80 // RW, UART reserved bit
#define RB_LCR_GP_BIT      0x80 // RW, UART general purpose bit
#define UART_IIR           4
#define RB_IIR_NO_INT      0x01 // RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt
#define RB_IIR_INT_MASK    0x0F // RO, UART interrupt flag bit mask
#define RB_IIR_FIFO_ID     0xC0 // RO, UART FIFO enabled flag
#define UART_LSR           5
#define RB_LSR_DATA_RDY    0x01 // RO, UART receiver fifo data ready status
#define RB_LSR_OVER_ERR    0x02 // RZ, UART receiver overrun error
#define RB_LSR_PAR_ERR     0x04 // RZ, UART receiver parity error
#define RB_LSR_FRAME_ERR   0x08 // RZ, UART receiver frame error
#define RB_LSR_BREAK_ERR   0x10 // RZ, UART receiver break error
#define RB_LSR_TX_FIFO_EMP 0x20 // RO, UART transmitter fifo empty status
#define RB_LSR_TX_ALL_EMP  0x40 // RO, UART transmitter all empty status
#define RB_LSR_ERR_RX_FIFO 0x80 // RO, indicate error in UART receiver fifo
#define UART_MSR           6
#define RB_MSR_CTS_CHG     0x01 // RZ, UART0 CTS changed status, high action
#define RB_MSR_DSR_CHG     0x02 // RZ, UART0 DSR changed status, high action
#define RB_MSR_RI_CHG      0x04 // RZ, UART0 RI changed status, high action
#define RB_MSR_DCD_CHG     0x08 // RZ, UART0 DCD changed status, high action
#define RB_MSR_CTS         0x10 // RO, UART0 CTS action status
#define RB_MSR_DSR         0x20 // RO, UART0 DSR action status
#define RB_MSR_RI          0x40 // RO, UART0 RI action status
#define RB_MSR_DCD         0x80 // RO, UART0 DCD action status
#define UART_RBR           8
#define UART_THR           8
#define UART_RFC           0x0A
#define UART_TFC           0x0B
#define UART_DLL           0x0C
#define UART_DLM           0x0D
#define UART_DIV           0x0E
#define UART_ADR           0x0F

/* UART interrupt identification values for IIR bits 3:0 */
#define UART_II_SLV_ADDR  0x0E // RO, UART0 slave address match
#define UART_II_LINE_STAT 0x06 // RO, UART interrupt by receiver line status
#define UART_II_RECV_RDY  0x04 // RO, UART interrupt by receiver data available
#define UART_II_RECV_TOUT 0x0C // RO, UART interrupt by receiver fifo timeout
#define UART_II_THR_EMPTY 0x02 // RO, UART interrupt by THR empty
#define UART_II_MODEM_CHG 0x00 // RO, UART0 interrupt by modem status change
#define UART_II_NO_INTER  0x01 // RO, no UART interrupt is pending

/* SPI0 register */
#define R32_SPI0_CONTROL     (*((vpuint32_t)0x40004000)) // RW, SPI0 control
#define R8_SPI0_CTRL_MOD     (*((vpuint8_t)0x40004000))  // RW, SPI0 mode control
#define R8_SPI0_CTRL_CFG     (*((vpuint8_t)0x40004001))  // RW, SPI0 configuration control
#define R8_SPI0_INTER_EN     (*((vpuint8_t)0x40004002))  // RW, SPI0 interrupt enable
#define R8_SPI0_CLOCK_DIV    (*((vpuint8_t)0x40004003))  // RW, SPI0 master clock divisor
#define R8_SPI0_SLAVE_PRE    (*((vpuint8_t)0x40004003))  // RW, SPI0 slave preset value
#define R32_SPI0_STATUS      (*((vpuint32_t)0x40004004)) // RW, SPI0 status
#define R8_SPI0_BUFFER       (*((vpuint8_t)0x40004004))  // RO, SPI0 data buffer
#define R8_SPI0_RUN_FLAG     (*((vpuint8_t)0x40004005))  // RO, SPI0 work flag
#define R8_SPI0_INT_FLAG     (*((vpuint8_t)0x40004006))  // RW1, SPI0 interrupt flag
#define R8_SPI0_FIFO_COUNT   (*((vpuint8_t)0x40004007))  // RO, SPI0 FIFO count status
#define R32_SPI0_TOTAL_CNT   (*((vpuint32_t)0x4000400C)) // RW, SPI0 total byte count, only low 12 bit
#define R16_SPI0_TOTAL_CNT   (*((vpuint16_t)0x4000400C)) // RW, SPI0 total byte count, only low 12 bit
#define R32_SPI0_FIFO        (*((vpuint32_t)0x40004010)) // RW, SPI0 FIFO register
#define R8_SPI0_FIFO         (*((vpuint8_t)0x40004010))  // RO/WO, SPI0 FIFO register
#define R8_SPI0_FIFO_COUNT1  (*((vpuint8_t)0x40004013))  // RO, SPI0 FIFO count status
#define R32_SPI0_DMA_NOW     (*((vpuint32_t)0x40004014)) // RW, SPI0 DMA current address
//#define R16_SPI0_DMA_NOW (*((vpuint16_t)0x40004014)) // RW, SPI0 DMA current address
#define R32_SPI0_DMA_BEG     (*((vpuint32_t)0x40004018)) // RW, SPI0 DMA begin address
//#define R16_SPI0_DMA_BEG (*((vpuint16_t)0x40004018)) // RW, SPI0 DMA begin address
#define R32_SPI0_DMA_END     (*((vpuint32_t)0x4000401C)) // RW, SPI0 DMA end address
//#define R16_SPI0_DMA_END (*((vpuint16_t)0x4000401C)) // RW, SPI0 DMA end address

/* SPI1 register */
#define R32_SPI1_CONTROL     (*((vpuint32_t)0x40004400)) // RW, SPI1 control
#define R8_SPI1_CTRL_MOD     (*((vpuint8_t)0x40004400))  // RW, SPI1 mode control
#define R8_SPI1_CTRL_CFG     (*((vpuint8_t)0x40004401))  // RW, SPI1 configuration c
#define R8_SPI1_INTER_EN     (*((vpuint8_t)0x40004402))  // RW, SPI1 interrupt enabl
#define R8_SPI1_CLOCK_DIV    (*((vpuint8_t)0x40004403))  // RW, SPI1 master clock di
#define R8_SPI1_SLAVE_PRE    (*((vpuint8_t)0x40004403))  // RW, SPI1 slave preset va
#define R32_SPI1_STATUS      (*((vpuint32_t)0x40004404)) // RW, SPI1 status
#define R8_SPI1_BUFFER       (*((vpuint8_t)0x40004404))  // RO, SPI1 data buffer
#define R8_SPI1_RUN_FLAG     (*((vpuint8_t)0x40004405))  // RO, SPI1 work flag
#define R8_SPI1_INT_FLAG     (*((vpuint8_t)0x40004406))  // RW1, SPI1 interrupt flag
#define R8_SPI1_FIFO_COUNT   (*((vpuint8_t)0x40004407))  // RO, SPI1 FIFO count stat
#define R32_SPI1_TOTAL_CNT   (*((vpuint32_t)0x4000440C)) // RW, SPI1 total byte coun
#define R16_SPI1_TOTAL_CNT   (*((vpuint16_t)0x4000440C)) // RW, SPI1 total byte coun
#define R32_SPI1_FIFO        (*((vpuint32_t)0x40004410)) // RW, SPI1 FIFO register
#define R8_SPI1_FIFO         (*((vpuint8_t)0x40004410))  // RO/WO, SPI1 FIFO registe
#define R8_SPI1_FIFO_COUNT1  (*((vpuint8_t)0x40004413))  // RO, SPI1 FIFO count stat
#define R32_SPI1_DMA_NOW     (*((vpuint32_t)0x40004414)) // RW, SPI1 DMA current add
//#define R16_SPI1_DMA_NOW (*((vpuint16_t)0x40004414)) // RW, SPI1 DMA current add
#define R32_SPI1_DMA_BEG     (*((vpuint32_t)0x40004418)) // RW, SPI1 DMA begin addre
//#define R16_SPI1_DMA_BEG (*((vpuint16_t)0x40004418)) // RW, SPI1 DMA begin addre
#define R32_SPI1_DMA_END     (*((vpuint32_t)0x4000441C)) // RW, SPI1 DMA end address
//#define R16_SPI1_DMA_END (*((vpuint16_t)0x4000441C)) // RW, SPI1 DMA end address

/* SPI register address offset and bit define */
#define SPI_FIFO_SIZE      8 // SPI FIFO size (depth)
#define BA_SPI0            ((vpuint8_t)0x40004000) // point SPI0 base address
#define BA_SPI1            ((vpuint8_t)0x40004400) // point SPI1 base address
#define SPI_CTRL_MOD       0
#define RB_SPI_MODE_SLAVE  0x01 // RW, SPI slave mode: 0=master/host, 1=slave/device
#define RB_SPI_ALL_CLEAR   0x02 // RW, force clear SPI FIFO and count
#define RB_SPI_2WIRE_MOD   0x04 // RW, SPI enable 2 wire mode: 0=3wire(SCK,MOSI,MISO), 1=2wire(SCK,MISO=MXSX)
#define RB_SPI_MST_SCK_MOD 0x08 // RW, SPI master clock mode: 0=mode 0, 1=mode 3
#define RB_SPI_SLV_CMD_MOD 0x08 // RW, SPI slave command mode: 0=byte stream, 1=first byte command
#define RB_SPI_FIFO_DIR    0x10 // RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)
#define RB_SPI_SCK_OE      0x20 // RW, SPI SCK output enable
#define RB_SPI_MOSI_OE     0x40 // RW, SPI MOSI output enable
#define RB_SPI1_SDO_OE     0x40 // RW, SPI1 SDO output enable
#define RB_SPI_MISO_OE     0x80 // RW, SPI MISO output enable
#define RB_SPI1_SDI_OE     0x80 // RW, SPI1 SDI output enable, SPI1 enable 2 wire mode: 0=3wire(SCK1,SDO,SDI), 1=2wire(SCK1,SDI=SDX)
#define SPI_CTRL_CFG       1
#define RB_SPI_DMA_ENABLE  0x01 // RW, SPI DMA enable
#define RB_SPI_DMA_LOOP    0x04 // RW, SPI DMA address loop enable
#define RB_SPI_AUTO_IF     0x10 // RW, enable buffer/FIFO accessing to auto clear RB_SPI_IF_BYTE_END interrupt flag
#define RB_SPI_BIT_ORDER   0x20 // RW, SPI bit data order: 0=MSB first, 1=LSB first
#define SPI_INTER_EN       2
#define RB_SPI_IE_CNT_END  0x01 // RW, enable interrupt for SPI total byte count end
#define RB_SPI_IE_BYTE_END 0x02 // RW, enable interrupt for SPI byte exchanged
#define RB_SPI_IE_FIFO_HF  0x04 // RW, enable interrupt for SPI FIFO half
#define RB_SPI_IE_DMA_END  0x08 // RW, enable interrupt for SPI DMA completion
#define RB_SPI_IE_FIFO_OV  0x10 // RW, enable interrupt for SPI FIFO overflow
#define RB_SPI_IE_FST_BYTE 0x80 // RW, enable interrupt for SPI slave mode first byte received
#define SPI_CLOCK_DIV      3
#define SPI_SLAVE_PRESET   3
#define SPI_BUFFER         4
#define SPI_RUN_FLAG       5
#define RB_SPI_SLV_CMD_ACT 0x10 // RO, SPI slave command flag
#define RB_SPI_FIFO_READY  0x20 // RO, SPI FIFO ready status
#define RB_SPI_SLV_CS_LOAD 0x40 // RO, SPI slave chip-select loading status
#define RB_SPI_SLV_SELECT  0x80 // RO, SPI slave selection status
#define SPI_INT_FLAG       6
#define RB_SPI_IF_CNT_END  0x01 // RW1, interrupt flag for SPI total byte count end
#define RB_SPI_IF_BYTE_END 0x02 // RW1, interrupt flag for SPI byte exchanged
#define RB_SPI_IF_FIFO_HF  0x04 // RW1, interrupt flag for SPI FIFO half (RB_SPI_FIFO_DIR ? >=4bytes : <4bytes)
#define RB_SPI_IF_DMA_END  0x08 // RW1, interrupt flag for SPI DMA completion
#define RB_SPI_IF_FIFO_OV  0x10 // RW1, interrupt flag for SPI FIFO overflow
#define RB_SPI_FREE        0x40 // RO, current SPI free status
#define RB_SPI_IF_FST_BYTE 0x80 // RW1, interrupt flag for SPI slave mode first byte received
#define SPI_FIFO_COUNT     7
#define SPI_TOTAL_CNT      0x0C
#define SPI_FIFO           0x10
#define SPI_DMA_NOW        0x14
#define SPI_DMA_BEG        0x18
#define SPI_DMA_END        0x1C

