catphish/simplescope-firmware/ch569.h
/* PWM0/1/2/3 register */
#define R32_PWM_CONTROL  (*((vpuint32_t)0x40005000)) // RW, PWM control
#define R8_PWM_CTRL_MOD  (*((vpuint8_t)0x40005000))  // RW, PWM mode control
#define R8_PWM_CTRL_CFG  (*((vpuint8_t)0x40005001))  // RW, PWM configuration control
#define R8_PWM_CLOCK_DIV (*((vpuint8_t)0x40005002))  // RW, PWM clock divisor
#define R32_PWM_DATA     (*((vpuint32_t)0x40005004)) // RW, PWM data holding
#define R8_PWM0_DATA     (*((vpuint8_t)0x40005004))  // RW, PWM0 data holding
#define R8_PWM1_DATA     (*((vpuint8_t)0x40005005))  // RW, PWM1 data holding
#define R8_PWM2_DATA     (*((vpuint8_t)0x40005006))  // RW, PWM2 data holding
#define R8_PWM3_DATA     (*((vpuint8_t)0x40005007))  // RW, PWM3 data holding

/* PWM0/1/2/3 register address offset and bit define */
#define BA_PWMX          ((vpuint8_t)0x40005000) // point PWM0/1/2/3 base address
#define PWM_CTRL_MOD     0
#define RB_PWM0_OUT_EN   0x01 // RW, PWM0 output enable
#define RB_PWM1_OUT_EN   0x02 // RW, PWM1 output enable
#define RB_PWM2_OUT_EN   0x04 // RW, PWM2 output enable
#define RB_PWM3_OUT_EN   0x08 // RW, PWM3 output enable
#define RB_PWM0_POLAR    0x10 // RW, PWM0 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM1_POLAR    0x20 // RW, PWM1 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM2_POLAR    0x40 // RW, PWM2 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM3_POLAR    0x80 // RW, PWM3 output polarity: 0=default low and high action, 1=default high and low action
#define PWM_CTRL_CFG     1
#define RB_PWM_CYCLE_SEL 0x01 // RW, PWM cycle selection: 0=256 clocks, 1=255 clocks
#define PWM_CLOCK_DIV    2
#define PWM0_DATA_HOLD   4
#define PWM1_DATA_HOLD   5
#define PWM2_DATA_HOLD   6
#define PWM3_DATA_HOLD   7

/* HSPI register */
#define R32_HSPI_CR        (*((vpuint32_t)0x40006000)) // RW, parallel if control
#define R8_HSPI_CFG        (*((vpuint8_t)0x40006000))  // RW, parallel if tx/rx cfg
#define R8_HSPI_CTRL       (*((vpuint8_t)0x40006001))  // RW, parallel if tx/rx control
#define R8_HSPI_INT_EN     (*((vpuint8_t)0x40006002))  // RW, parallel if interrupt enable register
#define R8_HSPI_AUX        (*((vpuint8_t)0x40006003))  // RW, parallel if aux
#define R32_HSPI_TX_ADDR0  (*((vpuint32_t)0x40006004)) // RW, parallel if dma tx addr0
#define R32_HSPI_TX_ADDR1  (*((vpuint32_t)0x40006008)) // RW, parallel if dma tx addr1
#define R32_HSPI_RX_ADDR0  (*((vpuint32_t)0x4000600C)) // RW, parallel if dma rx addr0
#define R32_HSPI_RX_ADDR1  (*((vpuint32_t)0x40006010)) // RW, parallel if dma rx addr1
#define R16_HSPI_DMA_LEN0  (*((vpuint16_t)0x40006014)) // RW, parallel if dma length0
#define R16_HSPI_RX_LEN0   (*((vpuint16_t)0x40006016)) // RO, parallel if receive length0
#define R16_HSPI_DMA_LEN1  (*((vpuint16_t)0x40006018)) // RW, parallel if dma length1
#define R16_HSPI_RX_LEN1   (*((vpuint16_t)0x4000601A)) // RO, parallel if receive length1
#define R16_HSPI_BURST_CFG (*((vpuint16_t)0x4000601C)) // RW, parallel if tx burst config register
#define R8_HSPI_BURST_CNT  (*((vpuint8_t)0x4000601E))  // RO, parallel if tx burst count
#define R32_HSPI_UDF0      (*((vpuint32_t)0x40006020)) // RW, parallel if
#define R32_HSPI_UDF1      (*((vpuint32_t)0x40006024)) // RW, parallel if
#define R32_HSPI_STATUS    (*((vpuint32_t)0x40006028)) // RW, parallel if status
#define R8_HSPI_INT_FLAG   (*((vpuint8_t)0x40006028))  // RW1, parallel if interrupt flag
#define R8_HSPI_RTX_STATUS (*((vpuint8_t)0x40006029))  // RO, parallel rtx status
#define R8_HSPI_TX_SC      (*((vpuint8_t)0x4000602A))  // RW, parallel TX sequence ctrl
#define R8_HSPI_RX_SC      (*((vpuint8_t)0x4000602B))  // RW, parallel RX sequence ctrl

/* HSPI register address offset and bit define */
#define HSPI_RTX_CFG        0
#define RB_HSPI_MODE        0x01 // RW, parallel if mode: 1=UP, 0=DOWN
#define RB_HSPI_DUALDMA     0x02 // RW, parallel if dualdma mode enable
#define RB_HSPI_MSK_SIZE    0x0C // RW, parallel if data mode
#define RB_HSPI_DAT8_MOD    0x00 // RW, 00=8bits mode
#define RB_HSPI_DAT16_MOD   0x04 // RW, 01=16bits mode
#define RB_HSPI_DAT32_MOD   0x08 // RW, 10=32bits mode
#define RB_HSPI_TX_TOG_EN   0x20 // RW, parallel if tx addr toggle enable
#define RB_HSPI_RX_TOG_EN   0x40 // RW, parallel if rx addr toggle enable
#define RB_HSPI_HW_ACK      0x80 // RW, parallel if tx ack by hardware
#define HSPI_RTX_CTRL       1
#define RB_HSPI_ENABLE      0x01 // RW, parallel if enable
#define RB_HSPI_DMA_EN      0x02 // RW, parallel if dma enable
#define RB_HSPI_SW_ACT      0x04 // RW, parallel if transmit software trigger
#define RB_HSPI_ALL_CLR     0x08 // RW, parallel if all clear
#define RB_HSPI_TRX_RST     0x10 // RW, parallel if tx and rx logic clear, high action
#define HSPI_INT_EN         2
#define RB_HSPI_IE_T_DONE   0x01 // RW, parallel if transmit done interrupt enable
#define RB_HSPI_IE_R_DONE   0x02 // RW, parallel if receive done interrupt enable
#define RB_HSPI_IE_FIFO_OV  0x04 // RW, parallel if fifo overflow interrupt enable
#define RB_HSPI_IE_B_DONE   0x08 // RW, RW, parallel if tx burst done interrupt enable
#define HSPI_RTX_AUX        3
#define RB_HSPI_TCK_MOD     0x01 // RW, parallel if tx clk polar control, 0=not invert, 1=invert
#define RB_HSPI_RCK_MOD     0x02 // RW, parallel if rx clk polar control, 0=not invert, 1=invert
#define RB_HSPI_ACK_TX_MOD  0x04 // RW, parallel if tx ack mode cfg, 0=ram write done to send, 1=delay done to send
#define RB_HSPI_ACK_CNT_SEL 0x18 // RW, delay time of parallel if send ack when receive done
#define RB_ACK_CNT_2        0x00 // RW, delay 2 clock to send ack
#define RB_ACK_CNT_4        0x08 // RW, delay 4 clock to send ack
#define RB_ACK_CNT_6        0x10 // RW, delay 6 clock to send ack
#define RB_ACK_CNT_8        0x18 // RW, delay 8 clock to send ack
#define RB_HSPI_REQ_FT      0x20 // RW, enable fast DMA request
#define HSPI_TX_ADDR0       4
#define HSPI_TX_ADDR1       5
#define HSPI_RX_ADDR0       6
#define HSPI_RX_ADDR1       7
#define HSPI_BURST_CFG      8
#define RB_HSPI_BURST_EN    0x0001 // RW, burst transmit enable
#define RB_HSPI_BURST_LEN   0xFF00 // RW, burst transmit length
#define HSPI_UDF0           9
#define HSPI_UDF1           10
#define HSPI_INT_FLAG       11
#define RB_HSPI_IF_T_DONE   0x01 // RW1, interrupt flag for parallel if transmit done
#define RB_HSPI_IF_R_DONE   0x02 // RW1, interrupt flag for parallel if receive done
#define RB_HSPI_IF_FIFO_OV  0x04 // RW1, interrupt flag for parallel if FIFO overflow
#define RB_HSPI_IF_B_DONE   0x08 // RW1, interrupt flag for parallel if tx burst done
#define HSPI_RTX_STATUS     12
//#define  RB_HSPI_TX_OK      0x01 // RO, data transmit OK (received ack)
#define RB_HSPI_CRC_ERR     0x02 // RO, CRC error occur
#define RB_HSPI_NUM_MIS     0x04 // RO, rx and tx sequence number mismatch
#define HSPI_TX_SC          13
#define RB_HSPI_TX_NUM      0x0F // RW, parallel if tx sequence num
#define RB_HSPI_TX_TOG      0x10 // RW, parallel if tx addr toggle flag
#define HSPI_RX_SC          14
#define RB_HSPI_RX_NUM      0x0F // RW, parallel if rx sequence num
#define RB_HSPI_RX_TOG      0x10 // RW, parallel if rx addr toggle flag

/* DVP register */
#define R32_DVP_CR       (*((vpuint32_t)0x4000E000)) // RW, DVP control register
#define R8_DVP_CR0       (*((vpuint8_t)0x4000E000))  // RW, DVP control register0
#define R8_DVP_CR1       (*((vpuint8_t)0x4000E001))  // RW, DVP control register1
#define R8_DVP_INT_EN    (*((vpuint8_t)0x4000E002))  // RW, DVP interrupt enable register
#define R16_DVP_ROW_NUM  (*((vpuint16_t)0x4000E004)) // RW, DVP row number of a frame indicator register
#define R16_DVP_COL_NUM  (*((vpuint16_t)0x4000E006)) // RW, DVP col number of a frame indicator register
#define R32_DVP_DMA_BUF0 (*((vpuint32_t)0x4000E008)) // RW, DVP dma buffer0 addr
#define R32_DVP_DMA_BUF1 (*((vpuint32_t)0x4000E00c)) // RW, DVP dma buffer1 addr
#define R32_DVP_STATUS   (*((vpuint32_t)0x4000E010))
#define R8_DVP_INT_FLAG  (*((vpuint8_t)0x4000E010))  // RW1, DVP interrupt flag register
#define R8_DVP_FIFO_ST   (*((vpuint8_t)0x4000E011))  // RO, DVP receive fifo status
#define R16_DVP_ROW_CNT  (*((vpuint16_t)0x4000E014)) // RO, DVP row count value
#define R16_DVP_COL_CNT  (*((vpuint16_t)0x4000E016)) // RO, DVP col count value

/* DVP register address offset and bit define */
#define DVP_CR0             0
#define RB_DVP_ENABLE       0x01 // RW, DVP enable
#define RB_DVP_V_POLAR      0x02 // RW, DVP VSYNC polarity control: 1 = invert, 0 = not invert
#define RB_DVP_H_POLAR      0x04 // RW, DVP HSYNC polarity control: 1 = invert, 0 = not invert
#define RB_DVP_P_POLAR      0x08 // RW, DVP PCLK polarity control: 1 = invert, 0 = not invert
#define RB_DVP_MSK_DAT_MOD  0x30
#define RB_DVP_D8_MOD       0x00 // RW, DVP 8bits data mode
#define RB_DVP_D10_MOD      0x10 // RW, DVP 10bits data mode
#define RB_DVP_D12_MOD      0x20 // RW, DVP 12bits data mode
#define RB_DVP_JPEG         0x40 // RW, DVP JPEG mode
#define RB_DVP_RAW_CM       0x80 // RW, DVP row count mode: 1 = count on falling edge of HSYNC, 0 = count on the end of col count
#define DVP_CR1             1
#define RB_DVP_DMA_EN       0x01 // RW, DVP dma enable
#define RB_DVP_ALL_CLR      0x02 // RW, DVP all clear, high action
#define RB_DVP_RCV_CLR      0x04 // RW, DVP receive logic clear, high action
#define RB_DVP_BUF_TOG      0x08 // RW, DVP bug toggle by software, write 1 to toggle, ignored writing 0
#define DVP_INT_EN          2
#define RB_DVP_IE_STR_FRM   0x01 // RW, DVP frame start interrupt enable
#define RB_DVP_IE_ROW_DONE  0x02 // RW, DVP row received done interrupt enable
#define RB_DVP_IE_FRM_DONE  0x04 // RW, DVP frame received done interrupt enable
#define RB_DVP_IE_FIFO_OV   0x08 // RW, DVP receive fifo overflow interrupt enable
#define RB_DVP_IE_STP_FRM   0x10 // RW, DVP frame stop interrupt enable
#define DVP_ROW_NUM         3
#define DVP_DMA_BUF0        4
#define DVP_DMA_BUF1        5
#define DVP_INT_FLAG        6
#define RB_DVP_IF_STR_FRM   0x01 // RW1, interrupt flag for DVP frame start
#define RB_DVP_IF_ROW_DONE  0x02 // RW1, interrupt flag for DVP row receive done
#define RB_DVP_IF_FRM_DONE  0x04 // RW1, interrupt flag for DVP frame receive done
#define RB_DVP_IF_FIFO_OV   0x08 // RW1, interrupt flag for DVP receive fifo overflow
#define RB_DVP_IF_STP_FRM   0x10 // RW1, interrupt flag for DVP frame stop
#define DVP_FIFO_ST         7
#define RB_DVP_FIFO_RDY     0x01 // RO, DVP receive fifo ready
#define RB_DVP_FIFO_FULL    0x02 // RO, DVP receive fifo full
#define RB_DVP_FIFO_OV      0x04 // RO, DVP receive fifo overflow
#define RB_DVP_MSK_FIFO_CNT 0x70 // RO, DVP receive fifo count
#define DVP_ROW_CNT         8
#define DVP_COL_CNT         9

/* SPI Flash register */
#define R32_SPI_ROM_CTRL (*((vpuint32_t)0x40001018))
#define R8_SPI_ROM_CTRL  (*((vpuint8_t)0x40001018))
#define R32_SPI_ROM_DATA (*((vpuint32_t)0x40001014)) //RW
#define R8_SPI_ROM_DATA  (*((vpuint8_t)0x40001018)) //RW
#define R16_SPI_ROM_CR   (*((vpuint16_t)0x4000101A)) //RW
#define R8_SPI_ROM_CR    (*((vpuint8_t)0x4000101A)) //RW

