catphish/simplescope-firmware/ch569.h
/* SPI Flash register address offset and bit define */
#define SPI_ROM_DATA    0
#define SPI_ROM_CR      1
#define RB_ROM_SCS      0x0001
#define RB_ROM_SIO0_OE  0x0002
#define RB_ROM_RD_EN    0x0004
#define RB_ROM_WR8      0x0008
#define RB_ROM_DES_LONG 0x0100

/* EMMC register */
#define R16_EMMC_CLK_DIV        (*((vpuint16_t)(0x4000A038))) // SD clock divider register, [4:0]:divisor, sdclk1 = 480m/[4:0], default divisor is 20
// [8]:clk_oe, [8]==1 indicate supply SDCLK to sdcard, [8]==0 indicate close SDCLK, default clk_oe is 0
// [9]:sel_25m_100m, select 400k or 25~100m as SDCLK, [9]==1 indicate SDCLK = 480m/[4:0], [9]==0 indicate SDCLK = 480/[4:0]/64, default is 1
#define R32_EMMC_ARGUMENT  (*((vpuint32_t)(0x4000A000))) // SD 32bits command argument register
#define R16_EMMC_CMD_SET   (*((vpuint16_t)(0x4000A004))) // SD 16bits cmd setting register, [5:0] is the command index, [9:8] indicate the response tye, [10]==1 indicate need to check the response CRC7, [11]==1 indicate need to check the index of the response
#define R32_EMMC_RESPONSE0 (*((vpuint32_t)(0x4000A008))) // SD 128bits response register, [31:0] 32bits
#define R32_EMMC_RESPONSE1 (*((vpuint32_t)(0x4000A00c))) // SD 128bits response register, [63:32] 32bits
#define R32_EMMC_RESPONSE2 (*((vpuint32_t)(0x4000A010))) // SD 128bits response register, [95:64] 32bits
#define R32_EMMC_RESPONSE3 (*((vpuint32_t)(0x4000A014))) // SD 128bits response register, [127:96] 32bits, when response length is 48, the 32bit response data is stored in this register
#define R8_EMMC_CONTROL    (*((vpuint8_t)(0x4000A018)))  // SD 8bits control register, [1:0] number of data line will operate, [2]==1 soft reset all the inner logic, [3]==1 enable DMA, [4]==1 reset inner data tran/recv logic, [5]==1 @negedge sample cmd/dat[7:0] lines
#define R8_EMMC_TIMEOUT    (*((vpuint8_t)(0x4000A01c)))  // SD 8bits data timeout value, the real timeout time is 4194304*Tsdclk*value
#define R32_EMMC_STATUS    (*((vpuint32_t)(0x4000A020))) // SD status:[15:0] number of current successful tran/recv blocks, [16] current sd cmd line level, [17] current sd dat[0] line level
#define R16_EMMC_INT_FG    (*((vpuint16_t)(0x4000A024))) // SD 16bits interrupt flag register
#define R16_EMMC_INT_EN    (*((vpuint16_t)(0x4000A028))) // SD 16bits interrupt enable register
#define R32_EMMC_DMA_BEG1  (*((vpuint32_t)(0x4000A02C))) // SD 16bits DMA start address register when to operate
#define R32_EMMC_BLOCK_CFG (*((vpuint32_t)(0x4000A030))) // SD 32bits data counter, [15:0] number of blocks this time will tran/recv, [27:16] block sise(byte number) of every block in this time tran/recv
#define R32_EMMC_TRAN_MODE (*((vpuint32_t)(0x4000A034))) // SD TRANSFER MODE register, [0] direction of this time, 1-write sd, 0-read sd, [1] stop at block gap when multiple wr/rd, [2] this time is eMMC boot mode operation
#define R32_EMMC_DMA_BEG2  (*((vpuint32_t)(0x4000A03C)))

/* EMMC register address offset and bit define */
#define EMMC_CLK_DIV        0x38
#define RB_EMMC_PHASEINV    0x400 // invert chip output sdclk phase
#define RB_EMMC_CLKMode     0x200 // 1:25-100m 0:400k
#define RB_EMMC_CLKOE       0x100 // chip output sdclk oe
#define RB_EMMC_DIV_MASK    0x1F // clk div
#define EMMC_ARGUMENT       0x00
#define EMMC_CMD_SET        0x04
#define RB_EMMC_CKIDX       0x800
#define RB_EMMC_CKCRC       0x400
#define RB_EMMC_RPTY_MASK   0x300
#define RB_EMMC_CMDIDX_MASK 0x3F
#define EMMC_RESPONSE0      0x08
#define EMMC_RESPONSE1      0x0c
#define EMMC_RESPONSE2      0x10
#define EMMC_RESPONSE3      0x14
#define EMMC_WRITE_CONT     0x14
#define EMMC_CONTROL        0x18
#define RB_EMMC_NEGSMP      0x0020 // controller use nagedge sample cmd, dat[7:0], when use UHS-I mode, timing is difficult to meet, use the negedge will be better, default is @posedge sample
#define RB_EMMC_RST_LGC     0x0010 // reset the data tran/recv logic, this bit is useful when block CRC error in multiple rd/wr situation, default is valid
#define RB_EMMC_DMAEN       0x0008 // enable the dma, if the 1# 2# 3# controller is to be used, should also open the 0# dma enable, 0# dma work as the whole enable, default dma is closed
#define RB_EMMC_ALL_CLR     0x0004 // reset all the inner logic, default is valid
#define RB_EMMC_LW_MASK     0x0003
#define bLW_OP_DAT8         0x0002 // use data line [7:0], can be set only in 0# 2# controller
#define bLW_OP_DAT4         0x0001 // use data line [3:0], the default is this value
#define bLW_OP_DAT0         0x0000 // use data line [0] only
#define EMMC_TIMEOUT        0x1C
#define RB_EMMC_TOCNT_MASK  0x000F
#define EMMC_STATUS         0x20    // SD status
#define RB_EMMC_DAT0STA     0x20000 // indicate dat[0] line is high level now
#define RB_EMMC_CMDSTA      0x10000 // indicate cmd line is high level now
#define EMMC_INT_FG         0x24
#define RB_EMMC_IF_SDIOINT  0x200 // interrupt from SDIO card inside
#define RB_EMMC_IF_FIFO_OV  0x100 // fifo overflow, when write sd, indicate empty overflow, when read sd, indicate full overflow
#define RB_EMMC_IF_BKGAP    0x080 // every block gap interrupt when multiple read/write, allow drive change the DMA address at this moment
#define RB_EMMC_IF_TRANDONE 0x040 // all the blocks have been tran/recv successfully
#define RB_EMMC_IF_TRANERR  0x020 // last block have encountered a CRC error
#define RB_EMMC_IF_DATTMO   0x010 // data line busy timeout
#define RB_EMMC_IF_CMDDONE  0x008 // when cmd hasn't response, indicate cmd has been sent, when cmd has a response, indicate cmd has bee sent and has received the response
#define RB_EMMC_IF_REIDX_ER 0x004 // indicate INDEX error of the response
#define RB_EMMC_IF_RECRC_WR 0x002 // indicate CRC error of the response
#define RB_EMMC_IF_RE_TMOUT 0x001 // indicate when expect the response, timeout
#define EMMC_INT_EN         0x28  // interrupt enable
#define RB_EMMC_IE_SDIOINT  0x200
#define RB_EMMC_IE_FIFO_OV  0x100
#define RB_EMMC_IE_BKGAP    0x080
#define RB_EMMC_IE_TRANDONE 0x040
#define RB_EMMC_IE_TRANERR  0x020
#define RB_EMMC_IE_DATTMO   0x010
#define RB_EMMC_IE_CMDDONE  0x008
#define RB_EMMC_IE_REIDX_ER 0x004
#define RB_EMMC_IE_RECRC_WR 0x002
#define RB_EMMC_IE_RE_TMOUT 0x001
#define EMMC_DMA_BEG1       0x2c
#define RB_EMMC_DMAAD1_MASK 0x1FFFF
#define EMMC_BLOCK_CFG      0x30
#define RB_EMMC_BKSIZE_MASK 0x01FF0000
#define RB_EMMC_BKNUM_MASK  0xFFFF
#define EMMC_TRAN_MODE      0x34    // tran mode
#define RB_EMMC_DULEDMA_EN  0x10000 // enable double buffer dma
#define RB_EMMC_DMATN_CNT   0x7f00
#define RB_EMMC_FIFO_RDY    0x00c0
#define RB_EMMC_AUTOGAPSTOP 0x00010 // enable auto set bTM_GAP_STOP when tran start
#define RB_EMMC_MODE_BOOT   0x00004 // enable emmc boot mode
#define RB_EMMC_GAP_STOP    0x00002 // set gap stop
#define RB_EMMC_DMA_DIR     0x00001 // set direction is controller to emmc card

/* ECED AES/SM4 register */
#define R16_ECEC_CTRL       (*((vpuint16_t)(0x40007000)))
#define RB_ECDC_DAT_MOD     0x02000 // source data and result data is bit endian
#define RB_ECDC_KLEN_MASK   0x0C00
#define RB_ECDC_CIPHER_MOD  0x0200 // 1:CTR mode 0:ECB mode
#define RB_ECDC_ALGRM_MOD   0x0100 // 1:AES 0:SM4
#define RB_ECDC_WRSRAM_EN   0x0080 // module dma enable
#define RB_ECDC_CLKDIV_MASK 0x0030
#define RB_ECDC_MODE_SEL    0x0008 // 1:decryption mode 0:encryption mode
#define RB_ECDC_WRPERI_EN   0x0004 // when read data from dma, 1:encrypt/decrypt 0:no action
#define RB_ECDC_RDPERI_EN   0x0002 // when write data to dma,  1:encrypt/decrypt 0:no action
#define RB_ECDC_KEYEX_EN    0x0001 // enable key expansion

#define R8_ECDC_INT_EN    (*((vpuint8_t)(0x40007002)))
#define RB_ECDC_IE_WRSRAM 0x04 // interrupt en
#define RB_ECDC_IE_SINGLE 0x02 // interrupt en
#define RB_ECDC_IE_EKDONE 0x01 // interrupt en

#define R8_ECDC_INT_FG    (*((vpuint8_t)(0x40007006)))
#define RB_ECDC_IF_WRSRAM 0x04 // interrupt en
#define RB_ECDC_IF_SINGLE 0x02 // interrupt en
#define RB_ECDC_IF_EKDONE 0x01 // interrupt en

//	the following 8*32-bit registers are used to store 128/192/256-bit key
#define R32_ECDC_KEY_255T224 (*((vpuint32_t)(0x40007008)))
#define R32_ECDC_KEY_223T192 (*((vpuint32_t)(0x4000700c)))
#define R32_ECDC_KEY_191T160 (*((vpuint32_t)(0x40007010)))
#define R32_ECDC_KEY_159T128 (*((vpuint32_t)(0x40007014)))
#define R32_ECDC_KEY_127T96  (*((vpuint32_t)(0x40007018)))
#define R32_ECDC_KEY_95T64   (*((vpuint32_t)(0x4000701c)))
#define R32_ECDC_KEY_63T32   (*((vpuint32_t)(0x40007020)))
#define R32_ECDC_KEY_31T0    (*((vpuint32_t)(0x40007024)))

//	the following 4*32-bit registers are used to store initial vector for CTR mode
#define R32_ECDC_IV_127T96   (*((vpuint32_t)(0x40007028)))
#define R32_ECDC_IV_95T64    (*((vpuint32_t)(0x4000702c)))
#define R32_ECDC_IV_63T32    (*((vpuint32_t)(0x40007030)))
#define R32_ECDC_IV_31T0     (*((vpuint32_t)(0x40007034)))

#define R32_ECDC_SGSD_127T96 (*((vpuint32_t)(0x40007040)))
#define R32_ECDC_SGSD_95T64  (*((vpuint32_t)(0x40007044)))
#define R32_ECDC_SGSD_63T32  (*((vpuint32_t)(0x40007048)))
#define R32_ECDC_SGSD_31T0   (*((vpuint32_t)(0x4000704C)))

#define R32_ECDC_SGRT_127T96 (*((vpuint32_t)(0x40007050)))
#define R32_ECDC_SGRT_95T64  (*((vpuint32_t)(0x40007054)))
#define R32_ECDC_SGRT_63T32  (*((vpuint32_t)(0x40007058)))
#define R32_ECDC_SGRT_31T0   (*((vpuint32_t)(0x4000705C)))

#define R32_ECDC_SRAM_ADDR   (*((vpuint32_t)(0x40007060)))
#define R32_ECDC_SRAM_LEN    (*((vpuint32_t)(0x40007064)))

/* Address space define */
#define BA_CODE ((puint32_t)0x00000000) // point code base address
#define SZ_CODE 0x00080000            // code size, Min:32KB, Max:96KB
#define BA_SFR  ((puint32_t)0x40000000) // point SFR base address
#define SZ_SFR  0x00010000            // SFR size
#define BA_RAM  ((puint32_t)0x20000000) // point RAM base address
#define SZ_RAM  0x00004000            // RAM size
#define BA_RAMX ((puint32_t)0x20020000) // point RAMX base address
#define SZ_RAMX 0x00018000            // RAMX size, Min:32KB, Max:96KB
#define BA_XBUS ((puint32_t)0x80000000) // point XBUS base address
#define SZ_XBUS 0x00008000            // XBUS size

