catphish/simplescope-firmware/ch569.h
/*----- Reference Information --------------------------------------------*/
#define ID_CH569W 0x71 // chip ID for CH569W
#define ID_CH565W 0x73 // chip ID for CH565W

/* Interrupt routine address and interrupt number */
#define INT_ID_WDOG   16 // interrupt number for watch-dog timer or software
#define INT_ID_TMR0   17 // interrupt number for timer0
#define INT_ID_GPIO   18 // interrupt number for GPIO
#define INT_ID_SPI0   19 // interrupt number for SPI0
#define INT_ID_USBSS  20 // interrupt number for USBSS
#define INT_ID_LINK   21 // interrupt number for USBSS Linklayer
#define INT_ID_TMR1   22 // interrupt number for timer1
#define INT_ID_TMR2   23 // interrupt number for timer2
#define INT_ID_UART0  24 // interrupt number for UART0
#define INT_ID_USBHS  25 // interrupt number for USBHS
#define INT_ID_EMMC   26 // interrupt number for EMMC
#define INT_ID_DVP    27 // interrupt number for DVP
#define INT_ID_HSPI   28 // interrupt number for HSPI
#define INT_ID_SPI1   29 // interrupt number for SPI1
#define INT_ID_UART1  30 // interrupt number for UART1
#define INT_ID_UART2  31 // interrupt number for UART2
#define INT_ID_UART3  32 // interrupt number for UART3
#define INT_ID_SERDES 33 // interrupt number for SERDES
#define INT_ID_ETH    34 // interrupt number for ETH
#define INT_ID_PMT    35 // interrupt number for ETH power management
#define INT_ID_ECDC   36 // interrupt number for ECDC

#define INT_VEC_ENTRY_SZ 4 // size of each interrupt vector entry
#define INT_ADDR_WDOG    (INT_ID_WDOG * INT_VEC_ENTRY_SZ)   // interrupt vector address for watch-dog timer or software
#define INT_ADDR_TMR0    (INT_ID_TMR0 * INT_VEC_ENTRY_SZ)   // interrupt vector address for TMR0
#define INT_ADDR_GPIO    (INT_ID_GPIO * INT_VEC_ENTRY_SZ)   // interrupt vector address for GPIO
#define INT_ADDR_SPI0    (INT_ID_SPI0 * INT_VEC_ENTRY_SZ)   // interrupt vector address for SPI0
#define INT_ADDR_USBSS   (INT_ID_USBSS * INT_VEC_ENTRY_SZ)  // interrupt vector address for USBSS
#define INT_ADDR_LINK    (INT_ID_LINK * INT_VEC_ENTRY_SZ)   // interrupt vector address for USBSS Linklayer
#define INT_ADDR_TMR1    (INT_ID_TMR1 * INT_VEC_ENTRY_SZ)   // interrupt vector address for TMR1
#define INT_ADDR_TMR2    (INT_ID_TMR2 * INT_VEC_ENTRY_SZ)   // interrupt vector address for TMR2
#define INT_ADDR_UART0   (INT_ID_UART0 * INT_VEC_ENTRY_SZ)  // interrupt vector address for UART0
#define INT_ADDR_USBHS   (INT_ID_USBHS * INT_VEC_ENTRY_SZ)  // interrupt vector address for USBHS
#define INT_ADDR_EMMC    (INT_ID_EMMC * INT_VEC_ENTRY_SZ)   // interrupt vector address for EMMC
#define INT_ADDR_DVP     (INT_ID_DVP * INT_VEC_ENTRY_SZ)    // interrupt vector address for DVP
#define INT_ADDR_HSPI    (INT_ID_HSPI * INT_VEC_ENTRY_SZ)   // interrupt vector address for HSPI
#define INT_ADDR_SPI1    (INT_ID_SPI1 * INT_VEC_ENTRY_SZ)   // interrupt vector address for SPI1
#define INT_ADDR_UART1   (INT_ID_UART1 * INT_VEC_ENTRY_SZ)  // interrupt vector address for UART1
#define INT_ADDR_UART2   (INT_ID_UART2 * INT_VEC_ENTRY_SZ)  // interrupt vector address for UART2
#define INT_ADDR_UART3   (INT_ID_UART3 * INT_VEC_ENTRY_SZ)  // interrupt vector address for UART3
#define INT_ADDR_SERDES  (INT_ID_SERDES * INT_VEC_ENTRY_SZ) // interrupt vector address for SERDES
#define INT_ADDR_ETH     (INT_ID_ETH * INT_VEC_ENTRY_SZ)    // interrupt vector address for ETH
#define INT_ADDR_PMT     (INT_ID_PMT * INT_VEC_ENTRY_SZ)    // interrupt vector address for ETH power management
#define INT_ADDR_ECDC    (INT_ID_ECDC * INT_VEC_ENTRY_SZ)   // interrupt vector address for ECDC

#ifndef TABLE_IRQN
typedef enum IRQn
{
	Reset_IRQn = 1,
	NMI_IRQn = 2,      /*!< Non Maskable Interrupt   */
	EXC_IRQn = 3,      /*!< Exceptions Interrupt      */
	SysTick_IRQn = 12, /*!< System timer Interrupt  */
	SWI_IRQn = 14,     /*!< software Interrupt */
	WDOG_IRQn = 16,
	TMR0_IRQn = 17,
	GPIO_IRQn = 18,
	SPI0_IRQn = 19,
	USBSS_IRQn = 20,
	LINK_IRQn = 21,
	TMR1_IRQn = 22,
	TMR2_IRQn = 23,
	UART0_IRQn = 24,
	USBHS_IRQn = 25,
	EMMC_IRQn = 26,
	DVP_IRQn = 27,
	HSPI_IRQn = 28,
	SPI1_IRQn = 29,
	UART1_IRQn = 30,
	UART2_IRQn = 31,
	UART3_IRQn = 32,
	SERDES_IRQn = 33,
	ETH_IRQn = 34,
	PMT_IRQn = 35,
	ECDC_IRQn = 36,
} IRQn_Type;
#endif

#endif // __CH56xGPSFR_H__

#ifndef __CH56xUSBSFR_H__
#define __CH56xUSBSFR_H__

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* usb addresses                                                              */
#define USB_BASE_ADDR (0x40009000)

#define R32_USB_CONTROL   (*((vpuint32_t)(USB_BASE_ADDR + 0x000))) // USB control & interrupt enable & device address
#define R8_USB_CTRL       (*((vpuint8_t)(USB_BASE_ADDR + 0x000)))  // USB base control
#define R8_UHOST_CTRL     (*((vpuint8_t)(USB_BASE_ADDR + 0x001)))  // USB actual speed
#define R8_USB_INT_EN     (*((vpuint8_t)(USB_BASE_ADDR + 0x002)))  // USB interrupt enable
#define R8_USB_DEV_AD     (*((vpuint8_t)(USB_BASE_ADDR + 0x003)))  // USB device address
#define R32_USB_FRAME_NO  (*((vpuint32_t)(USB_BASE_ADDR + 0x004)))
#define R16_USB_FRAME_NO  (*((vpuint16_t)(USB_BASE_ADDR + 0x004)))
#define R8_USB_SUSPEND    (*((vpuint8_t)(USB_BASE_ADDR + 0x006)))
#define R32_USB_STATUS    (*((vpuint32_t)(USB_BASE_ADDR + 0x008))) // USB miscellaneous status & interrupt flag & interrupt status
#define R8_USB_SPD_TYPE   (*((vpuint8_t)(USB_BASE_ADDR + 0x008)))  // USB actual speed
#define R8_USB_MIS_ST     (*((vpuint8_t)(USB_BASE_ADDR + 0x009)))  // USB miscellaneous status
#define R8_USB_INT_FG     (*((vpuint8_t)(USB_BASE_ADDR + 0x00a)))  // USB interrupt flag
#define R8_USB_INT_ST     (*((vpuint8_t)(USB_BASE_ADDR + 0x00b)))  // USB interrupt status
#define R16_USB_RX_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x00c))) // USB receiving length
#define R32_USB_BUF_MODE  (*((vpuint32_t)(USB_BASE_ADDR + 0x010))) // USB endpoint buffer mode
#define R8_UEP4_1_MOD     (*((vpuint8_t)(USB_BASE_ADDR + 0x010)))  // endpoint 4/1 mode
#define R8_UEP2_3_MOD     (*((vpuint8_t)(USB_BASE_ADDR + 0x011)))  // endpoint 2/3 mode
#define R8_UEP5_6_MOD     (*((vpuint8_t)(USB_BASE_ADDR + 0x012)))  // endpoint 5/6 mode
#define R8_UEP7_MOD       (*((vpuint8_t)(USB_BASE_ADDR + 0x013)))  // endpoint 7 mode
#define R8_UH_EP_MOD      R8_UEP2_3_MOD // host endpoint mode
#define R32_UEP0_RT_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x014))) // endpoint 0 DMA RX buffer address
#define R32_UEP1_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x018))) // endpoint 1 DMA RX buffer address
#define R32_UEP2_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x01c))) // endpoint 2 DMA RX buffer address
#define R32_UEP3_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x020))) // endpoint 3 DMA RX buffer address
#define R32_UEP4_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x024))) // endpoint 4 DMA RX buffer address
#define R32_UEP5_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x028))) // endpoint 5 DMA RX buffer address
#define R32_UEP6_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x02C))) // endpoint 6 DMA RX buffer address
#define R32_UEP7_RX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x030))) // endpoint 7 DMA RX buffer address
#define R32_UH_RX_DMA     R32_UEP2_RX_DMA // host rx endpoint buffer high address
#define R32_UH_TX_DMA     R32_UEP3_TX_DMA // host tx endpoint buffer high address
#define R32_UEP1_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x034))) // endpoint 1 DMA TX buffer address
#define R32_UEP2_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x038))) // endpoint 2 DMA TX buffer address
#define R32_UEP3_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x03C))) // endpoint 3 DMA TX buffer address
#define R32_UEP4_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x040))) // endpoint 4 DMA TX buffer address
#define R32_UEP5_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x044))) // endpoint 5 DMA TX buffer address
#define R32_UEP6_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x048))) // endpoint 6 DMA TX buffer address
#define R32_UEP7_TX_DMA   (*((vpuint32_t)(USB_BASE_ADDR + 0x04C))) // endpoint 7 DMA TX buffer address
#define R16_UEP0_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x050)))
#define R16_UEP1_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x054)))
#define R16_UEP2_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x058)))
#define R16_UEP3_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x05C)))
#define R16_UEP4_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x060)))
#define R16_UEP5_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x064)))
#define R16_UEP6_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x068)))
#define R16_UEP7_MAX_LEN  (*((vpuint16_t)(USB_BASE_ADDR + 0x06C)))
#define R16_UH_RX_MAX_LEN R16_UEP2_MAX_LEN
#define R32_USB_EP0_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x070))) // endpoint 0 control & transmittal length
#define R16_UEP0_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x070))) // endpoint 0 transmittal length
#define R8_UEP0_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x072)))  // endpoint 0 tx control
#define R8_UEP0_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x073)))  // endpoint 0 rx control

#define R32_USB_EP1_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x074))) // endpoint 1 control & transmittal length
#define R16_UEP1_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x074))) // endpoint 1 transmittal length
#define R8_UEP1_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x076)))  // endpoint 1 control
#define R8_UEP1_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x077)))  // endpoint 1 control

