catphish/simplescope-firmware/ch569.h
//#define R8_UH_SETUP     R8_UEP1_TX_CTRL // host aux setup
#define R32_USB_EP2_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x078))) // endpoint 2 control & transmittal length
#define R16_UEP2_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x078))) // endpoint 2 transmittal length
#define R8_UEP2_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x07A)))  // endpoint 2 control
#define R8_UEP2_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x07B)))  // endpoint 2 control

#define R16_UH_EP_PID     R16_UEP2_T_LEN // host endpoint and PID
#define R8_UH_RX_CTRL     R8_UEP2_RX_CTRL // host receiver endpoint control
#define R32_USB_EP3_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x07C))) // endpoint 3 control & transmittal length
#define R16_UEP3_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x07C))) // endpoint 3 transmittal length
#define R8_UEP3_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x07E)))  // endpoint 3 control
#define R8_UEP3_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x07F)))  // endpoint 3 control

#define R16_UH_TX_LEN     R16_UEP3_T_LEN // host transmittal endpoint transmittal length
#define R8_UH_TX_CTRL     R8_UEP3_TX_CTRL // host transmittal endpoint control

#define R32_USB_EP4_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x080))) // endpoint 4 control & transmittal length
#define R16_UEP4_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x080))) // endpoint 4 transmittal length
#define R8_UEP4_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x082)))  // endpoint 4 control
#define R8_UEP4_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x083)))  // endpoint 4 control

#define R16_UH_SPLIT_DATA R16_UEP4_T_LEN

#define R32_USB_EP5_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x084))) // endpoint 5 control & transmittal length
#define R16_UEP5_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x084))) // endpoint 5 transmittal length
#define R8_UEP5_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x086)))  // endpoint 5 control
#define R8_UEP5_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x087)))  // endpoint 5 control

#define R32_USB_EP6_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x088))) // endpoint 6 control & transmittal length
#define R16_UEP6_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x088))) // endpoint 6 transmittal length
#define R8_UEP6_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x08A)))  // endpoint 6 control
#define R8_UEP6_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x08B)))  // endpoint 6 control

#define R32_USB_EP7_CTRL  (*((vpuint32_t)(USB_BASE_ADDR + 0x08C))) // endpoint 7 control & transmittal length
#define R16_UEP7_T_LEN    (*((vpuint16_t)(USB_BASE_ADDR + 0x08C))) // endpoint 7 transmittal length
#define R8_UEP7_TX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x08E)))  // endpoint 7 control
#define R8_UEP7_RX_CTRL   (*((vpuint8_t)(USB_BASE_ADDR + 0x08F)))  // endpoint 7 control

/*  USB register address offset and bit define */

/* USB base control registers: R8_USB_CTRL  */
#define RB_USB_HOST_MODE 0x80 // enable USB host mode: 0=device mode, 1=host mode
#define RB_USB_SPTP_MASK 0x60 // enable USB low speed: 00=full speed, 01=high speed, 10 =low speed
#define UCST_FS          0x00
#define UCST_HS          0x20
#define UCST_LS          0x40
#define RB_DEV_PU_EN     0x10 // USB device enable and internal pullup resistance enable
#define RB_USB_INT_BUSY  0x08 // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define RB_USB_RESET_SIE 0x04 // force reset USB SIE, need software clear
#define RB_USB_CLR_ALL   0x02 // force clear FIFO and count of USB
#define RB_USB_DMA_EN    0x01 // DMA enable and DMA interrupt enable for USB

/* USB interrupt enable registers: R8_USB_INT_EN  */
#define RB_USB_IE_DEV_NAK  0x80 // enable interrupt for NAK responded for USB device mode
#define RB_USB_IE_ISOACT   0x40
#define RB_USB_IE_SETUPACT 0x20
#define RB_USB_IE_FIFOOV   0x10 // enable interrupt for FIFO overflow
#define RB_USB_IE_SOF      0x08 // enable interrupt for host SOF timer action for USB host mode
#define RB_USB_IE_SUSPEND  0x04 // enable interrupt for USB suspend or resume event
#define RB_USB_IE_TRANS    0x02 // enable interrupt for USB transfer completion
#define RB_USB_IE_DETECT   0x01 // enable interrupt for USB device detected event for USB host mode
#define RB_USB_IE_BUSRST   0x01 // enable interrupt for USB bus reset event for USB device mode

/* R8_USB_SUSPEND  */
//#define bUS_WAKE_UP 0x04  // wake up from suspend
#define RB_DEV_WAKEUP     0x02 //remote resume

/* R8_USB_SPD_TYPE  */
#define RB_USBSPEED_MASK  0x03
#define UST_FS            0x00 // USB_SPD_TYPE is full speed
#define UST_HS            0x01 // USB_SPD_TYPE is high speed
#define UST_LS            0x02 // USB_SPD_TYPE is low speed

/* ReadOnly, USB miscellaneous status registers:  R8_USB_MIS_ST  */
#define RB_USB_SOF_PRES   0x80 // ReadOnly: indicate host SOF timer presage status
#define RB_USB_SOF_ACT    0x40 // ReadOnly: indicate host SOF timer action status for USB host
#define RB_USB_SIE_FREE   0x20 // ReadOnly: indicate USB SIE free status
#define RB_USB_FIFO_RDY   0x10 // ReadOnly: indicate USB receiving FIFO ready status (not empty)
#define RB_USBBUS_RESET   0x08 // ReadOnly: indicate USB bus reset status
#define RB_USBBUS_SUSPEND 0x04 // ReadOnly: indicate USB suspend status
#define RB_USB_ATTACH     0x02 // ReadOnly: indicate device attached status on USB hub DP/DM
#define RB_USB_SPLIT_EN   0x01 // ReadOnly: indicate host allow SPLIT packet

/* USB interrupt flag registers:  R8_USB_INT_FG   */
#define RB_USB_IF_ISOACT   0x40
#define RB_USB_IF_SETUOACT 0x20
#define RB_USB_IF_FIFOOV   0x10 // FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
#define RB_USB_IF_HST_SOF  0x08 // host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
#define RB_USB_IF_SUSPEND  0x04 // USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
#define RB_USB_IF_TRANSFER 0x02 // USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
#define RB_USB_IF_DETECT   0x01 // device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
#define RB_USB_IF_BUSRST   0x01 // bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear

/* ReadOnly, USB interrupt status registers:  R8_USB_INT_ST  */
#define RB_USB_ST_NAK     0x80 // ReadOnly: indicate current USB transfer is NAK received for USB device mode
#define RB_USB_ST_TOGOK   0x40 // ReadOnly: indicate current USB transfer toggle is OK
#define RB_DEV_TOKEN_MASK 0x30 // ReadOnly: bit mask of current token PID code received for USB device mode
#define RB_DEV_ENDP_MASK  0x0F // ReadOnly: bit mask of current transfer endpoint number for USB device mode
#define RB_HOST_RES_MASK  0x0F // ReadOnly: bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received

#define UIS_TOKEN_OUT     0x00
#define UIS_TOKEN_SOF     0x10
#define UIS_TOKEN_IN      0x20
#define UIS_TOKEN_SETUP   0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device mode
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: SETUP token PID received

/* USB device endpoint 1/4 buffer mode registers: R8_UEP4_1_MOD */
#define RB_UEP1_RX_EN   0x80 // enable USB endpoint 1 receiving (OUT)
#define RB_UEP1_TX_EN   0x40 // enable USB endpoint 1 transmittal (IN)
#define RB_UEP1_BUF_MOD 0x10 // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  512 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 512 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=1024bytes
//   0 1 0:  512 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 512 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=1024bytes
//   1 1 0:  512 bytes buffer for receiving (OUT endpoint) + 512 bytes buffer for transmittal (IN endpoint), total=1024bytes
//   1 1 1:  dual 512 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 512 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=2048bytes
#define RB_UEP4_RX_EN   0x08 // enable USB endpoint 4 receiving (OUT)
#define RB_UEP4_TX_EN   0x04 // enable USB endpoint 4 transmittal (IN)
#define RB_UEP4_BUF_MOD 0x01 // buffer mode of USB endpoint 4

/* USB device endpoint 2/3 buffer mode registers: R8_UEP2_3_MOD */
#define RB_UEP3_RX_EN   0x80 // enable USB endpoint 3 receiving (OUT)
#define RB_UEP3_TX_EN   0x40 // enable USB endpoint 3 transmittal (IN)
#define RB_UEP3_BUF_MOD 0x10 // buffer mode of USB endpoint 3
#define RB_UEP2_RX_EN   0x08 // enable USB endpoint 2 receiving (OUT)
#define RB_UEP2_TX_EN   0x04 // enable USB endpoint 2 transmittal (IN)
#define RB_UEP2_BUF_MOD 0x01 // buffer mode of USB endpoint 2

