catphish/simplescope-firmware/ch569.h
/* USB device endpoint 5/6 buffer mode registers: R8_UEP5_6_MOD */
#define RB_UEP6_RX_EN   0x80 // enable USB endpoint 6 receiving (OUT)
#define RB_UEP6_TX_EN   0x40 // enable USB endpoint 6 transmittal (IN)
#define RB_UEP6_BUF_MOD 0x10 // buffer mode of USB endpoint 6
#define RB_UEP5_RX_EN   0x08 // enable USB endpoint 5 receiving (OUT)
#define RB_UEP5_TX_EN   0x04 // enable USB endpoint 5 transmittal (IN)
#define RB_UEP5_BUF_MOD 0x01 // buffer mode of USB endpoint 5

/* USB device endpoint 7 buffer mode registers: R8_UEP7_MOD */
#define RB_UEP7_RX_EN   0x08 // enable USB endpoint 7 receiving (OUT)
#define RB_UEP7_TX_EN   0x04 // enable USB endpoint 7 transmittal (IN)
#define RB_UEP7_BUF_MOD 0x01 // buffer mode of USB endpoint 7

/* R8_UEPn_TX_CTRL  n=0-15 */
#define RB_UEP_T_AUTOTOG  0x20 // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define RB_UEP_T_TOG_MASK 0x18 // prepared data toggle flag of USB endpoint X transmittal (IN): 00=DATA0, 01=DATA1, 10=DATA2, 11=MDATA
#define RB_UEP_T_TOG_0    (0 << 3)
#define RB_UEP_T_TOG_1    (1 << 3)
#define RB_UEP_T_TOG_2    (2 << 3)
#define RB_UEP_T_TOG_M    (3 << 3)
#define RB_UEP_TRES_NO    (0x04) // expected no response, 1=enable, 0=disable, for non-zero endpoint isochronous transactions
#define RB_UEP_TRES_MASK  (0x03) // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define UEP_T_RES_ACK     0x00
#define UEP_T_RES_NAK     0x02
#define UEP_T_RES_STALL   0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: ACK (ready)
//   10: NAK (busy)
//   11: STALL (error)

/* R8_UEPn_RX_CTRL  n=0-15 */
#define RB_UEP_R_AUTOTOG  0x20 // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define RB_UEP_R_TOG_MASK 0x18 // expected data toggle flag of USB endpoint X receiving (OUT): 00s=DATA0, 01=DATA1, 10=DATA2, 11=MDATA
#define RB_UEP_R_TOG_0   (0 << 3)
#define RB_UEP_R_TOG_1   (1 << 3)
#define RB_UEP_R_TOG_2   (2 << 3)
#define RB_UEP_R_TOG_M   (3 << 3)
#define RB_UEP_RRES_NO   (0x04) // prepared no response, 1=enable, 0=disable, for non-zero endpoint isochronous transactions
#define RB_UEP_RRES_MASK (0x03) // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define UEP_R_RES_ACK    (0x00)
#define UEP_R_RES_NAK    (0x02)
#define UEP_R_RES_STALL  (0x03)
#define UEP_R_RES_NYET   (0x01)
// bUEP_R_RES1 & bUEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   10: NAK (busy)
//   11: STALL (error)
//   01: NYET

// bUEP_T_TOG1 & bUEP_T_TOG0 / bUEP_R_TOG1 & bUEP_R_TOG0 : toggle flag
#define UEP_DATA0 (0x00 << 3)
#define UEP_DATA1 (0x01 << 3)
#define UEP_DATA2 (0x02 << 3)
#define UEP_MDATA (0x03 << 3)

/*   R8_UHOST_CTRL */
#define RB_UH_AUTOSOF_EN  0x80 // USB host automatic SOF enable
#define RB_UH_BUS_RESUME  0x04
#define RB_UH_BUS_SUSPEND 0x02
#define RB_UH_BUS_RESET   0x01

/* USB host buffer mode registers: R8_UH_EP_MOD */
#define RB_UH_TX_EN           0x40              // enable USB host OUT endpoint transmittal
//#define bUH_EP_TBUF_MOD   0x10      // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  512 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 512 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=1024bytes
#define RB_UH_RX_EN           0x08              // enable USB host IN endpoint receiving
//#define bUH_EP_RBUF_MOD   0x01      // buffer mode of USB host IN endpoint
// bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  512 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 512 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=1024bytes

/* USB host PID registers:  R16_UH_EP_PID  */
#define RB_UH_TOKEN_MASK 0xF0 // bit mask of token PID for USB host transfer
#define RB_UH_EPNUM_MASK 0x0F // bit mask of endpoint number for USB host transfer

/* USB host RX control registers: R8_UH_RX_CTRL  */
#define RB_UH_RDATA_NO   0x40 // expect no data packet, for high speed hub in host mode
#define RB_UH_R_AUTOTOG  0x20 // enable automatic toggle after successful receiver completion: 0=manual toggle, 1=automatic toggle
#define RB_UH_R_TOG_MASK 0x18 // expected data toggle flag of host receiving (IN): 00=DATA0, 01=DATA1, 10=DATA2, 11=MDATA
#define RB_UH_RRES_NO    0x04 // prepared no response, 1=enable, 0=disable, for non-zero endpoint isochronous transactions
#define RB_UH_RRES_MASK  0x03 // prepared handshake response type for host receiving (IN)
// bUH_R_RES1 & bUH_R_RES0: handshake response type for host receiving (IN)
//   00: ACK (ready)
//   10: NAK (busy)
//   11: STALL (error)

/* USB host TX control registers: R8_UH_TX_CTRL */
#define RB_UH_TDATA_NO   0x40 // prepared no data packet, for high speed hub in host mode
#define RB_UH_T_AUTOTOG  0x20 // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define RB_UH_T_TOG_MASK 0x18 // prepared data toggle flag of host transmittal (SETUP/OUT): 00=DATA0, 01=DATA1, 10=DATA2, 11=MDATA
#define RB_UH_TRES_NO    0x04 // expected no response, 1=enable, 0=disable, for non-zero endpoint isochronous transactions
#define RB_UH_TRES_MASK  0x03 // expected handshake response type for host transmittal (SETUP/OUT)
// bUH_T_RES1 & bUH_T_RES0: expected handshake response type for host transmittal (SETUP/OUT)
//   00: ACK (ready)
//   10: NAK (busy)
//   11: STALL (error)
//   01: NYET

// toggle flag
#define UH_DATA0 (0x00 << 3)
#define UH_DATA1 (0x01 << 3)
#define UH_DATA2 (0x02 << 3)
#define UH_MDATA (0x03 << 3)

// handshake response
#define UH_ACK   0x00
#define UH_NAK   0x02
#define UH_STALL 0x03
#define UH_NYET  0x01

/*********************************************************/
/*                  USB 3.0                              */
/*********************************************************/
#ifndef __PACKED
#define __PACKED    __attribute__((packed))
#endif

#define USBSS_BASE    (0x40008000)

typedef struct __PACKED
{
	vuint32_t LINK_CFG;          // 0x40008000
	vuint32_t LINK_CTRL;         // 0x40008004
	vuint32_t LINK_INT_CTRL;     // 0x40008008
	vuint32_t LINK_INT_FLAG;     // 0x4000800C
	vuint32_t LINK_STATUS;       // 0x40008010
	vuint32_t LINK_HP_BUF_CTRL;  // 0x40008014
	vuint32_t LINK_ERR_STATUS;   // 0x40008018
	vuint32_t LINK_ERR_CNT;      // 0x4000801C
	vuint32_t USB_CONTROL;       // 0x40008020
	vuint32_t USB_STATUS;        // 0x40008024
	vuint32_t HOST_STATUS;       // 0x40008028
	vuint32_t USB_RX_LEN;        // 0x4000802C
	vuint32_t USB_ITP;           // 0x40008030
	vuint32_t USB_ITP_ADJ;       // 0x40008034
	vuint32_t LINK_ISO_DLY;      // 0x40008038
	vuint32_t LINK_STREAM_ID;    // 0x4000803C
	vuint32_t LINK_ROUTE_STRING; // 0x40008040
	vuint32_t USB_FC_CTRL;       // 0x40008044
	vuint32_t LMP_TX_DATA0;      // 0x40008048
	vuint32_t LMP_TX_DATA1;      // 0x4000804C
	vuint32_t LMP_TX_DATA2;      // 0x40008050
	vuint32_t LMP_PORT_CAP;      // 0x40008054
	vuint32_t LMP_RX_DATA0;      // 0x40008058
	vuint32_t LMP_RX_DATA1;      // 0x4000805C
	vuint32_t LMP_RX_DATA2;      // 0x40008060
	vuint32_t TP_RX_DATA0;       // 0x40008064
	vuint32_t TP_RX_DATA1;       // 0x40008068
	vuint32_t TP_RX_DATA2;       // 0x4000806C
	vuint32_t UEP_CFG;           // 0x40008070
	vuint32_t UEP0_DMA;          // 0x40008074
	vuint32_t UEP0_RX_CTRL;      // 0x40008078
	vuint32_t UEP0_TX_CTRL;      // 0x4000807C
	vuint32_t UEP1_TX_DMA;       // 0x40008080
	vuint32_t UEP1_RX_DMA;       // 0x40008084
	vuint32_t UEP1_RX_CTRL;      // 0x40008088
	vuint32_t UEP1_TX_CTRL;      // 0x4000808C
	vuint32_t UEP2_RX_DMA;       // 0x40008090
	vuint32_t UEP2_TX_DMA;       // 0x40008094
	vuint32_t UEP2_RX_CTRL;      // 0x40008098
	vuint32_t UEP2_TX_CTRL;      // 0x4000809C
	vuint32_t UEP3_TX_DMA;       // 0x400080A0
	vuint32_t UEP3_RX_DMA;       // 0x400080A4
	vuint32_t UEP3_RX_CTRL;      // 0x400080A8
	vuint32_t UEP3_TX_CTRL;      // 0x400080AC
	vuint32_t UEP4_TX_DMA;       // 0x400080B0
	vuint32_t UEP4_RX_DMA;       // 0x400080B4
	vuint32_t UEP4_RX_CTRL;      // 0x400080B8
	vuint32_t UEP4_TX_CTRL;      // 0x400080BC
	vuint32_t UEP5_TX_DMA;       // 0x400080C0
	vuint32_t UEP5_RX_DMA;       // 0x400080C4
	vuint32_t UEP5_RX_CTRL;      // 0x400080C8
	vuint32_t UEP5_TX_CTRL;      // 0x400080CC
	vuint32_t UEP6_TX_DMA;       // 0x400080D0
	vuint32_t UEP6_RX_DMA;       // 0x400080D4
	vuint32_t UEP6_RX_CTRL;      // 0x400080D8
	vuint32_t UEP6_TX_CTRL;      // 0x400080DC
	vuint32_t UEP7_TX_DMA;       // 0x400080E0
	vuint32_t UEP7_RX_DMA;       // 0x400080E4
	vuint32_t UEP7_RX_CTRL;      // 0x400080E8
	vuint32_t UEP7_TX_CTRL;      // 0x400080EC
	vuint32_t UX_EXIT_TIMER;     // 0x400080F0

} USBSS_TypeDef;

typedef struct __PACKED
{
	vuint32_t LINK_CFG;          // 0x40008000
	vuint32_t LINK_CTRL;         // 0x40008004
	vuint32_t LINK_INT_CTRL;     // 0x40008008
	vuint32_t LINK_INT_FLAG;     // 0x4000800C
	vuint32_t LINK_STATUS;       // 0x40008010
	vuint32_t LINK_HP_BUF_CTRL;  // 0x40008014
	vuint32_t LINK_ERR_STATUS;   // 0x40008018
	vuint32_t LINK_ERR_CNT;      // 0x4000801C
	vuint32_t USB_CONTROL;       // 0x40008020
	vuint32_t USB_STATUS;        // 0x40008024
	vuint32_t HOST_STATUS;       // 0x40008028
	vuint32_t USB_RX_LEN;        // 0x4000802C
	vuint32_t USB_ITP;           // 0x40008030
	vuint32_t USB_ITP_ADJ;       // 0x40008034
	vuint32_t LINK_ISO_DLY;      // 0x40008038
	vuint32_t LINK_STREAM_ID;    // 0x4000803C
	vuint32_t LINK_ROUTE_STRING; // 0x40008040
	vuint32_t USB_FC_CTRL;       // 0x40008044
	vuint32_t LMP_TX_DATA0;      // 0x40008048
	vuint32_t LMP_TX_DATA1;      // 0x4000804C
	vuint32_t LMP_TX_DATA2;      // 0x40008050
	vuint32_t LMP_PORT_CAP;      // 0x40008054
	vuint32_t LMP_RX_DATA0;      // 0x40008058
	vuint32_t LMP_RX_DATA1;      // 0x4000805C
	vuint32_t LMP_RX_DATA2;      // 0x40008060
	vuint32_t TP_RX_DATA0;       // 0x40008064
	vuint32_t TP_RX_DATA1;       // 0x40008068
	vuint32_t TP_RX_DATA2;       // 0x4000806C
	vuint32_t UEP_CFG;           // 0x40008070
	vuint32_t reserved0;         // 0x40008074
	vuint32_t reserved1;         // 0x40008078
	vuint32_t reserved2;         // 0x4000807C
	vuint32_t UH_TX_DMA;         // 0x40008080
	vuint32_t UH_RX_DMA;         // 0x40008084
	vuint32_t UH_RX_CTRL;        // 0x40008088
	vuint32_t UH_TX_CTRL;        // 0x4000808C
} USBSSH_TypeDef;

#define USBSS     ((USBSS_TypeDef *)USBSS_BASE)
#define USBSSH    ((USBSSH_TypeDef *)USBSS_BASE)

#endif // __CH56xUSBSFR_H__

