catphish/simplescope-firmware/ch569.h
#ifndef USB_CFG_DESCR_LONG
typedef struct __PACKED _USB_CONFIG_DESCR_LONG
{
	USB_CFG_DESCR  cfg_descr;
	USB_ITF_DESCR  itf_descr;
	USB_ENDP_DESCR endp_descr[2];
} USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;
#endif

#ifndef USB_HUB_DESCR
typedef struct __PACKED _USB_HUB_DESCR
{
	uint8_t bDescLength;
	uint8_t bDescriptorType;
	uint8_t bNbrPorts;
	uint8_t wHubCharacteristicsL;
	uint8_t wHubCharacteristicsH;
	uint8_t bPwrOn2PwrGood;
	uint8_t bHubContrCurrent;
	uint8_t DeviceRemovable;
	uint8_t PortPwrCtrlMask;
} USB_HUB_DESCR, *PUSB_HUB_DESCR;
#endif

#ifndef USB_HID_DESCR
typedef struct __PACKED _USB_HID_DESCR
{
	uint8_t bLength;
	uint8_t bDescriptorType;
	uint8_t bcdHIDL;
	uint8_t bcdHIDH;
	uint8_t bCountryCode;
	uint8_t bNumDescriptors;
	uint8_t bDescriptorTypeX;
	uint8_t wDescriptorLengthL;
	uint8_t wDescriptorLengthH;
} USB_HID_DESCR, *PUSB_HID_DESCR;
#endif

#ifndef USB_DEV_QUAL_DESCR
typedef struct __PACKED _USB_DEVICE_QUALIFIER_DESCRIPTOR
{
	uint8_t bLength;
	uint8_t bDescriptorType;
	uint8_t bcdUSBL;
	uint8_t bcdUSBH;
	uint8_t bDeviceClass;
	uint8_t bDeviceSubClass;
	uint8_t bDeviceProtocol;
	uint8_t bMaxPacketSize0;
	uint8_t bNumConfigurations;
	uint8_t bReserved;
} USB_DEV_QUAL_DESCR, *PUSB_DEV_QUAL_DESCR;
#endif

#ifndef USB_CFG_PWR_DESCR
typedef struct __PACKED _USB_CONFIGURATION_POWER_DESCRIPTOR
{
	uint8_t bLength;
	uint8_t bDescriptorType;
	uint8_t SelfPowerConsumedD0[3];
	uint8_t bPowerSummaryId;
	uint8_t bBusPowerSavingD1;
	uint8_t bSelfPowerSavingD1;
	uint8_t bBusPowerSavingD2;
	uint8_t bSelfPowerSavingD2;
	uint8_t bBusPowerSavingD3;
	uint8_t bSelfPowerSavingD3;
	uint8_t TransitionTimeFromD1L;
	uint8_t TransitionTimeFromD1H;
	uint8_t TransitionTimeFromD2L;
	uint8_t TransitionTimeFromD2H;
	uint8_t TransitionTimeFromD3L;
	uint8_t TransitionTimeFromD3H;
} USB_CFG_PWR_DESCR, *PUSB_CFG_PWR_DESCR;
#endif

#ifndef USB_ITF_PWR_DESCR
typedef struct __PACKED _USB_INTERFACE_POWER_DESCRIPTOR
{
	uint8_t bLength;
	uint8_t bDescriptorType;
	uint8_t bmCapabilitiesFlags;
	uint8_t bBusPowerSavingD1;
	uint8_t bSelfPowerSavingD1;
	uint8_t bBusPowerSavingD2;
	uint8_t bSelfPowerSavingD2;
	uint8_t bBusPowerSavingD3;
	uint8_t bSelfPowerSavingD3;
	uint8_t TransitionTimeFromD1L;
	uint8_t TransitionTimeFromD1H;
	uint8_t TransitionTimeFromD2L;
	uint8_t TransitionTimeFromD2H;
	uint8_t TransitionTimeFromD3L;
	uint8_t TransitionTimeFromD3H;
} USB_ITF_PWR_DESCR, *PUSB_ITF_PWR_DESCR;
#endif

#define USB_BO_CBW_SIG    0x43425355 /* Command block CBW identification flag 'USBC' */
#define USB_BO_CSW_SIG    0x53425355 /* Command Status Block CSW Identification Flag 'USBS' */

typedef struct __PACKED _UDISK_BOC_CBW
{
	uint32_t mCBW_Sig;
	uint32_t mCBW_Tag;
	uint32_t mCBW_DataLen; /* Input: Data transfer length */
	uint8_t  mCBW_Flag; /* Input: flag such as transmission direction */
	uint8_t  mCBW_LUN;
	uint8_t  mCBW_CB_Len; /* Input: The length of the command block, valid values are 1 to 16 */
	uint8_t  mCBW_CB_Buf[16]; /* Input: command block, the buffer can be up to 16 bytes */
} UDISK_BOC_CBW, *PUDISK_BOC_CBW;

typedef struct __PACKED _UDISK_BOC_CSW
{
	uint32_t mCSW_Sig;
	uint32_t mCSW_Tag;
	uint32_t mCSW_Residue; /* Returns: remaining data length */
	uint8_t  mCSW_Status; /* Returns: command execution result status */
} UDISK_BOC_CSW, *PUDISK_BOC_CSW;

#endif // __USB_TYPE__

#ifndef __CH56xSDSSFR_H__
#define __CH56xSDSSFR_H__

#define SERDES_BASE    (0x4000B000)

typedef struct
{
	vuint32_t SDS_CTRL;     // 0x4000B000
	vuint32_t SDS_INT_EN;   // 0x4000B004
	vuint32_t SDS_STATUS;   // 0x4000B008
	vuint32_t SDS_RTX_CTRL; // 0x4000B00C
	vuint32_t SDS_RX_LEN0;  // 0x4000B010
	vuint32_t SDS_DATA0;    // 0x4000B014
	vuint32_t SDS_DMA0;     // 0x4000B018
	vuint32_t SDS_RX_LEN1;  // 0x4000B01C
	vuint32_t SDS_DATA1;    // 0x4000B020
	vuint32_t SDS_DMA1;     // 0x4000B024
} SDS_TypeDef;

#define SDS    ((SDS_TypeDef *)SERDES_BASE)

#endif // __CH56xSDSSFR_H__

#ifndef __CH56xETHSFR_H__
#define __CH56xETHSFR_H__

#define ETH_BASE        (0x4000C000)

/**
 * @brief  ETH MAC Init structure definition
 * @note   The user should not configure all the ETH_InitTypeDef structure's fields.
 *   By calling the ETH_StructInit function the structure fields are set to their default values.
 *   Only the parameters that will be set to a non-default value should be configured.
 */

#define PHY_10M_EN      0
#define ETHMAC_Mode     0x00  //01:100M 00:10M 10:1000M
#define TB_NUM          0x08

#define DMA_TPS_Mask    ((uint32_t)0x00700000)
#define DMA_RPS_Mask    ((uint32_t)0x000E0000)

typedef struct
{
	/**
	 * @brief / * MAC
	 */
	uint32_t ETH_AutoNegotiation; /*!< Selects or not the AutoNegotiation mode for the external PHY
                                       The AutoNegotiation allows an automatic setting of the Speed (10/100Mbps)
                                       and the mode (half/full-duplex).
                                       This parameter can be a value of @ref ETH_AutoNegotiation */

	uint32_t ETH_Watchdog; /*!< Selects or not the Watchdog timer
                                When enabled, the MAC allows no more then 2048 bytes to be received.
                                When disabled, the MAC can receive up to 16384 bytes.
                                This parameter can be a value of @ref ETH_watchdog */

	uint32_t ETH_Jabber; /*!< Selects or not Jabber timer
                              When enabled, the MAC allows no more then 2048 bytes to be sent.
                              When disabled, the MAC can send up to 16384 bytes.
                              This parameter can be a value of @ref ETH_Jabber */

	uint32_t ETH_InterFrameGap; /*!< Selects the minimum IFG between frames during transmission
                                     This parameter can be a value of @ref ETH_Inter_Frame_Gap */

	uint32_t ETH_CarrierSense; /*!< Selects or not the Carrier Sense
                                    This parameter can be a value of @ref ETH_Carrier_Sense */

	uint32_t ETH_Speed; /*!< Sets the Ethernet speed: 10/100 Mbps
                             This parameter can be a value of @ref ETH_Speed */

