catphish/simplescope-firmware/ch569.h
	uint32_t ETH_ReceiveOwn; /*!< Selects or not the ReceiveOwn
                                  ReceiveOwn allows the reception of frames when the TX_EN signal is asserted
                                  in Half-Duplex mode
                                  This parameter can be a value of @ref ETH_Receive_Own */

	uint32_t ETH_LoopbackMode; /*!< Selects or not the internal MAC MII Loopback mode
                                    This parameter can be a value of @ref ETH_Loop_Back_Mode */

	uint32_t ETH_Mode; /*!< Selects the MAC duplex mode: Half-Duplex or Full-Duplex mode
                            This parameter can be a value of @ref ETH_Duplex_Mode */

	uint32_t ETH_ChecksumOffload; /*!< Selects or not the IPv4 checksum checking for received frame payloads' TCP/UDP/ICMP headers.
                                       This parameter can be a value of @ref ETH_Checksum_Offload */

	uint32_t ETH_RetryTransmission; /*!< Selects or not the MAC attempt retries transmission, based on the settings of BL,
                                         when a colision occurs (Half-Duplex mode)
                                         This parameter can be a value of @ref ETH_Retry_Transmission */

	uint32_t ETH_AutomaticPadCRCStrip; /*!< Selects or not the Automatic MAC Pad/CRC Stripping
                                            This parameter can be a value of @ref ETH_Automatic_Pad_CRC_Strip */

	uint32_t ETH_BackOffLimit; /*!< Selects the BackOff limit value
                                    This parameter can be a value of @ref ETH_Back_Off_Limit */

	uint32_t ETH_DeferralCheck; /*!< Selects or not the deferral check function (Half-Duplex mode)
                                     This parameter can be a value of @ref ETH_Deferral_Check */

	uint32_t ETH_ReceiveAll; /*!< Selects or not all frames reception by the MAC (No fitering)
                                  This parameter can be a value of @ref ETH_Receive_All */

	uint32_t ETH_SourceAddrFilter; /*!< Selects the Source Address Filter mode
                                        This parameter can be a value of @ref ETH_Source_Addr_Filter */

	uint32_t ETH_PassControlFrames; /*!< Sets the forwarding mode of the control frames (including unicast and multicast PAUSE frames)
                                         This parameter can be a value of @ref ETH_Pass_Control_Frames */

	uint32_t ETH_BroadcastFramesReception; /*!< Selects or not the reception of Broadcast Frames
                                                This parameter can be a value of @ref ETH_Broadcast_Frames_Reception */

	uint32_t ETH_DestinationAddrFilter; /*!< Sets the destination filter mode for both unicast and multicast frames
                                             This parameter can be a value of @ref ETH_Destination_Addr_Filter */

	uint32_t ETH_PromiscuousMode; /*!< Selects or not the Promiscuous Mode
                                       This parameter can be a value of @ref ETH_Promiscuous_Mode */

	uint32_t ETH_MulticastFramesFilter; /*!< Selects the Multicast Frames filter mode: None/HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                             This parameter can be a value of @ref ETH_Multicast_Frames_Filter */

	uint32_t ETH_UnicastFramesFilter; /*!< Selects the Unicast Frames filter mode: HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                           This parameter can be a value of @ref ETH_Unicast_Frames_Filter */

	uint32_t ETH_HashTableHigh; /*!< This field holds the higher 32 bits of Hash table.  */

	uint32_t ETH_HashTableLow; /*!< This field holds the lower 32 bits of Hash table.  */

	uint32_t ETH_PauseTime; /*!< This field holds the value to be used in the Pause Time field in the
                                 transmit control frame */

	uint32_t ETH_ZeroQuantaPause; /*!< Selects or not the automatic generation of Zero-Quanta Pause Control frames
                                       This parameter can be a value of @ref ETH_Zero_Quanta_Pause */

	uint32_t ETH_PauseLowThreshold; /*!< This field configures the threshold of the PAUSE to be checked for
                                         automatic retransmission of PAUSE Frame
                                         This parameter can be a value of @ref ETH_Pause_Low_Threshold */

	uint32_t ETH_UnicastPauseFrameDetect; /*!< Selects or not the MAC detection of the Pause frames (with MAC Address0
                                               unicast address and unique multicast address)
                                               This parameter can be a value of @ref ETH_Unicast_Pause_Frame_Detect */

	uint32_t ETH_ReceiveFlowControl; /*!< Enables or disables the MAC to decode the received Pause frame and
                                          disable its transmitter for a specified time (Pause Time)
                                          This parameter can be a value of @ref ETH_Receive_Flow_Control */

	uint32_t ETH_TransmitFlowControl; /*!< Enables or disables the MAC to transmit Pause frames (Full-Duplex mode)
                                           or the MAC back-pressure operation (Half-Duplex mode)
                                           This parameter can be a value of @ref ETH_Transmit_Flow_Control */

	uint32_t ETH_VLANTagComparison; /*!< Selects the 12-bit VLAN identifier or the complete 16-bit VLAN tag for
                                         comparison and filtering
                                         This parameter can be a value of @ref ETH_VLAN_Tag_Comparison */

	uint32_t ETH_VLANTagIdentifier; /*!< Holds the VLAN tag identifier for receive frames */

	/**
	 * @brief / * DMA
	 */
	uint32_t ETH_DropTCPIPChecksumErrorFrame; /*!< Selects or not the Dropping of TCP/IP Checksum Error Frames
                                                   This parameter can be a value of @ref ETH_Drop_TCP_IP_Checksum_Error_Frame */

	uint32_t ETH_ReceiveStoreForward; /*!< Enables or disables the Receive store and forward mode
                                           This parameter can be a value of @ref ETH_Receive_Store_Forward */

	uint32_t ETH_FlushReceivedFrame; /*!< Enables or disables the flushing of received frames
                                          This parameter can be a value of @ref ETH_Flush_Received_Frame */

	uint32_t ETH_TransmitStoreForward; /*!< Enables or disables Transmit store and forward mode
                                            This parameter can be a value of @ref ETH_Transmit_Store_Forward */

	uint32_t ETH_TransmitThresholdControl; /*!< Selects or not the Transmit Threshold Control
                                                This parameter can be a value of @ref ETH_Transmit_Threshold_Control */

	uint32_t ETH_ForwardErrorFrames; /*!< Selects or not the forward to the DMA of erroneous frames
                                          This parameter can be a value of @ref ETH_Forward_Error_Frames */

	uint32_t ETH_ForwardUndersizedGoodFrames; /*!< Enables or disables the Rx FIFO to forward Undersized frames (frames with no Error
                                                   and length less than 64 bytes) including pad-bytes and CRC)
                                                   This parameter can be a value of @ref ETH_Forward_Undersized_Good_Frames */

	uint32_t ETH_ReceiveThresholdControl; /*!< Selects the threshold level of the Receive FIFO
                                               This parameter can be a value of @ref ETH_Receive_Threshold_Control */

	uint32_t ETH_SecondFrameOperate; /*!< Selects or not the Operate on second frame mode, which allows the DMA to process a second
                                          frame of Transmit data even before obtaining the status for the first frame.
                                          This parameter can be a value of @ref ETH_Second_Frame_Operate */

	uint32_t ETH_AddressAlignedBeats; /*!< Enables or disables the Address Aligned Beats
                                           This parameter can be a value of @ref ETH_Address_Aligned_Beats */

