catphish/simplescope-firmware/ch569.h
	uint32_t ETH_FixedBurst; /*!< Enables or disables the AHB Master interface fixed burst transfers
                                  This parameter can be a value of @ref ETH_Fixed_Burst */

	uint32_t ETH_RxDMABurstLength; /*!< Indicates the maximum number of beats to be transferred in one Rx DMA transaction
                                        This parameter can be a value of @ref ETH_Rx_DMA_Burst_Length */

	uint32_t ETH_TxDMABurstLength; /*!< Indicates sthe maximum number of beats to be transferred in one Tx DMA transaction
                                        This parameter can be a value of @ref ETH_Tx_DMA_Burst_Length */

	uint32_t ETH_DescriptorSkipLength; /*!< Specifies the number of word to skip between two unchained descriptors (Ring mode) */

	uint32_t ETH_DMAArbitration; /*!< Selects the DMA Tx/Rx arbitration
                                      This parameter can be a value of @ref ETH_DMA_Arbitration */
} ETH_InitTypeDef;

/**--------------------------------------------------------------------------**/
/**
 * @brief                           DMA descriptors types
 */
/**--------------------------------------------------------------------------**/

/**
 * @brief  ETH DMA Desciptors data structure definition
 */
typedef struct
{
	uint32_t Status;              /*!< Status */
	uint32_t ControlBufferSize;   /*!< Control and Buffer1, Buffer2 lengths */
	uint32_t Buffer1Addr;         /*!< Buffer1 address pointer */
	uint32_t Buffer2NextDescAddr; /*!< Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/**
 * @}
 */

/** @defgroup ETH_Exported_Constants
 * @{
 */

/**
 * @brief Uncomment the line below if you want to use user defined Delay function
 *        (for precise timing), otherwise default _eth_delay_ function defined within
 *        this driver is used (less precise timing).
 */
/* #define USE_Delay */

#ifdef USE_Delay
#include "main.h"
#define _eth_delay_    Delay  /*!< User can provide more timing precise _eth_delay_ function */
#else
#define _eth_delay_    ETH_Delay  /*!< Default _eth_delay_ function with less precise timing */
#endif

/**--------------------------------------------------------------------------**/
/**
 * @brief                          ETH Frames defines
 */
/**--------------------------------------------------------------------------**/

/** @defgroup ENET_Buffers_setting
 * @{
 */
#define ETH_MAX_PACKET_SIZE 1520 /*!< ETH_HEADER + ETH_EXTRA + MAX_ETH_PAYLOAD + ETH_CRC */
#define ETH_HEADER          14   /*!< 6 byte Dest addr, 6 byte Src addr, 2 byte length/type */
#define ETH_CRC             4    /*!< Ethernet CRC */
#define ETH_EXTRA           2    /*!< Extra bytes in some cases */
#define VLAN_TAG            4    /*!< optional 802.1q VLAN Tag */
#define MIN_ETH_PAYLOAD     46   /*!< Minimum Ethernet payload size */
#define MAX_ETH_PAYLOAD     1500 /*!< Maximum Ethernet payload size */
#define JUMBO_FRAME_PAYLOAD 9000 /*!< Jumbo frame payload size */

/**--------------------------------------------------------------------------**/
/**
 * @brief                 Ethernet DMA descriptors registers bits definition
 */
/**--------------------------------------------------------------------------**/

/**
@code
   DMA Tx Desciptor
  -----------------------------------------------------------------------------------------------
  TDES0 | OWN(31) | CTRL[30:26] | Reserved[25:24] | CTRL[23:20] | Reserved[19:17] | Status[16:0] |
  -----------------------------------------------------------------------------------------------
  TDES1 | Reserved[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] | Buffer1 ByteCount[12:0] |
  -----------------------------------------------------------------------------------------------
  TDES2 |                         Buffer1 Address [31:0]                                         |
  -----------------------------------------------------------------------------------------------
  TDES3 |                   Buffer2 Address [31:0] / Next Desciptor Address [31:0]               |
  -----------------------------------------------------------------------------------------------
@endcode
*/

/**
 * @brief  Bit definition of TDES0 register: DMA Tx descriptor status register
 */
#define ETH_DMATxDesc_OWN                    ((uint32_t)0x80000000) /*!< OWN bit: descriptor is owned by DMA engine */
#define ETH_DMATxDesc_IC                     ((uint32_t)0x40000000) /*!< Interrupt on Completion */
#define ETH_DMATxDesc_LS                     ((uint32_t)0x20000000) /*!< Last Segment */
#define ETH_DMATxDesc_FS                     ((uint32_t)0x10000000) /*!< First Segment */
#define ETH_DMATxDesc_DC                     ((uint32_t)0x08000000) /*!< Disable CRC */
#define ETH_DMATxDesc_DP                     ((uint32_t)0x04000000) /*!< Disable Padding */
#define ETH_DMATxDesc_TTSE                   ((uint32_t)0x02000000) /*!< Transmit Time Stamp Enable */
#define ETH_DMATxDesc_CIC                    ((uint32_t)0x00C00000) /*!< Checksum Insertion Control: 4 cases */
#define ETH_DMATxDesc_CIC_ByPass             ((uint32_t)0x00000000) /*!< Do Nothing: Checksum Engine is bypassed */
#define ETH_DMATxDesc_CIC_IPV4Header         ((uint32_t)0x00400000) /*!< IPV4 header Checksum Insertion */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Segment ((uint32_t)0x00800000) /*!< TCP/UDP/ICMP Checksum Insertion calculated over segment only */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Full    ((uint32_t)0x00C00000) /*!< TCP/UDP/ICMP Checksum Insertion fully calculated */
#define ETH_DMATxDesc_TER                    ((uint32_t)0x00200000) /*!< Transmit End of Ring */
#define ETH_DMATxDesc_TCH                    ((uint32_t)0x00100000) /*!< Second Address Chained */
#define ETH_DMATxDesc_TTSS                   ((uint32_t)0x00020000) /*!< Tx Time Stamp Status */
#define ETH_DMATxDesc_IHE                    ((uint32_t)0x00010000) /*!< IP Header Error */
#define ETH_DMATxDesc_ES                     ((uint32_t)0x00008000) /*!< Error summary: OR of the following bits: UE || ED || EC || LCO || NC || LCA || FF || JT */
#define ETH_DMATxDesc_JT                     ((uint32_t)0x00004000) /*!< Jabber Timeout */
#define ETH_DMATxDesc_FF                     ((uint32_t)0x00002000) /*!< Frame Flushed: DMA/MTL flushed the frame due */

#endif // __CH56xETHSFR_H__
